[Killed] BlockStatement
src/arrayUtils.js:2:23
 class ArrayUtils {
-  static safeSum(arr) {
-    if (!Array.isArray(arr)) return 0;
-    let sum = 0;
-    for (const n of arr) {
-      if (typeof n === 'number' && Number.isFinite(n)) sum += n;
-    }
-    return sum;
-  }
+  static safeSum(arr) {}
 
   static average(arr) {
killedBy: ArrayUtils safeSum works
statusReason: expected undefined to equal 6

[Killed] ConditionalExpression
src/arrayUtils.js:3:9
 class ArrayUtils {
   static safeSum(arr) {
-    if (!Array.isArray(arr)) return 0;
+    if (true) return 0;
     let sum = 0;
     for (const n of arr) {
killedBy: ArrayUtils safeSum works
statusReason: expected +0 to equal 6

[Killed] BooleanLiteral
src/arrayUtils.js:3:9
 class ArrayUtils {
   static safeSum(arr) {
-    if (!Array.isArray(arr)) return 0;
+    if (Array.isArray(arr)) return 0;
     let sum = 0;
     for (const n of arr) {
killedBy: ArrayUtils safeSum works
statusReason: expected +0 to equal 6

[Killed] BlockStatement
src/arrayUtils.js:5:26
   static safeSum(arr) {
     if (!Array.isArray(arr)) return 0;
     let sum = 0;
-    for (const n of arr) {
-      if (typeof n === 'number' && Number.isFinite(n)) sum += n;
-    }
+    for (const n of arr) {}
     return sum;
   }
killedBy: ArrayUtils safeSum works
statusReason: expected +0 to equal 6

[Killed] ConditionalExpression
src/arrayUtils.js:6:11
     if (!Array.isArray(arr)) return 0;
     let sum = 0;
     for (const n of arr) {
-      if (typeof n === 'number' && Number.isFinite(n)) sum += n;
+      if (false) sum += n;
     }
     return sum;
killedBy: ArrayUtils safeSum works
statusReason: expected +0 to equal 6

[Killed] AssignmentOperator
src/arrayUtils.js:6:56
     if (!Array.isArray(arr)) return 0;
     let sum = 0;
     for (const n of arr) {
-      if (typeof n === 'number' && Number.isFinite(n)) sum += n;
+      if (typeof n === 'number' && Number.isFinite(n)) sum -= n;
     }
     return sum;
killedBy: ArrayUtils safeSum works
statusReason: expected -6 to equal 6

[Killed] BlockStatement
src/arrayUtils.js:11:23
     return sum;
   }
 
-  static average(arr) {
-    if (!Array.isArray(arr) || arr.length === 0) return null;
-    const sum = this.safeSum(arr);
-    return sum / arr.length;
-  }
+  static average(arr) {}
 
   static unique(arr) {
killedBy: ArrayUtils average works
statusReason: expected undefined to equal 3

[Killed] ConditionalExpression
src/arrayUtils.js:12:9
   }
 
   static average(arr) {
-    if (!Array.isArray(arr) || arr.length === 0) return null;
+    if (true) return null;
     const sum = this.safeSum(arr);
     return sum / arr.length;
killedBy: ArrayUtils average works
statusReason: expected null to equal 3

[Killed] BooleanLiteral
src/arrayUtils.js:12:9
   }
 
   static average(arr) {
-    if (!Array.isArray(arr) || arr.length === 0) return null;
+    if (Array.isArray(arr) || arr.length === 0) return null;
     const sum = this.safeSum(arr);
     return sum / arr.length;
killedBy: ArrayUtils average works
statusReason: expected null to equal 3

[Killed] ArithmeticOperator
src/arrayUtils.js:14:12
   static average(arr) {
     if (!Array.isArray(arr) || arr.length === 0) return null;
     const sum = this.safeSum(arr);
-    return sum / arr.length;
+    return sum * arr.length;
   }
 
killedBy: ArrayUtils average works
statusReason: expected 12 to equal 3

[Killed] BlockStatement
src/arrayUtils.js:17:22
     return sum / arr.length;
   }
 
-  static unique(arr) {
-    if (!Array.isArray(arr)) return [];
-    const seen = new Set();
-    const out = [];
-
-    for (const v of arr) {
-      const key = typeof v === 'object' ? JSON.stringify(v) : v;
-      if (!seen.has(key)) {
-        seen.add(key);
-        out.push(v);
-      }
-    }
-    return out;
-  }
+  static unique(arr) {}
 
   static chunk(arr, size) {
killedBy: ArrayUtils unique works
statusReason: expected undefined to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
src/arrayUtils.js:18:9
   }
 
   static unique(arr) {
-    if (!Array.isArray(arr)) return [];
+    if (true) return [];
     const seen = new Set();
     const out = [];
killedBy: ArrayUtils unique works
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] BooleanLiteral
src/arrayUtils.js:18:9
   }
 
   static unique(arr) {
-    if (!Array.isArray(arr)) return [];
+    if (Array.isArray(arr)) return [];
     const seen = new Set();
     const out = [];
killedBy: ArrayUtils unique works
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] BlockStatement
src/arrayUtils.js:22:26
     const seen = new Set();
     const out = [];
 
-    for (const v of arr) {
-      const key = typeof v === 'object' ? JSON.stringify(v) : v;
-      if (!seen.has(key)) {
-        seen.add(key);
-        out.push(v);
-      }
-    }
+    for (const v of arr) {}
     return out;
   }
killedBy: ArrayUtils unique works
statusReason: expected [] to deeply equal [ 1, 2 ]

[Survived] ConditionalExpression
src/arrayUtils.js:23:19
     const out = [];
 
     for (const v of arr) {
-      const key = typeof v === 'object' ? JSON.stringify(v) : v;
+      const key = true ? JSON.stringify(v) : v;
       if (!seen.has(key)) {
         seen.add(key);

[Survived] ConditionalExpression
src/arrayUtils.js:23:19
     const out = [];
 
     for (const v of arr) {
-      const key = typeof v === 'object' ? JSON.stringify(v) : v;
+      const key = false ? JSON.stringify(v) : v;
       if (!seen.has(key)) {
         seen.add(key);

[Killed] BooleanLiteral
src/arrayUtils.js:24:11
 
     for (const v of arr) {
       const key = typeof v === 'object' ? JSON.stringify(v) : v;
-      if (!seen.has(key)) {
+      if (seen.has(key)) {
         seen.add(key);
         out.push(v);
killedBy: ArrayUtils unique works
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
src/arrayUtils.js:24:11
 
     for (const v of arr) {
       const key = typeof v === 'object' ? JSON.stringify(v) : v;
-      if (!seen.has(key)) {
+      if (true) {
         seen.add(key);
         out.push(v);
killedBy: ArrayUtils unique works
statusReason: expected [ 1, 1, 2 ] to deeply equal [ 1, 2 ]

[Killed] BlockStatement
src/arrayUtils.js:32:27
     return out;
   }
 
-  static chunk(arr, size) {
-    if (!Array.isArray(arr) || size <= 0) return [];
-    const out = [];
-    for (let i = 0; i < arr.length; i += size) {
-      out.push(arr.slice(i, i + size));
-    }
-    return out;
-  }
+  static chunk(arr, size) {}
 }
 
killedBy: ArrayUtils chunk works
statusReason: expected undefined to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] BooleanLiteral
src/arrayUtils.js:33:9
   }
 
   static chunk(arr, size) {
-    if (!Array.isArray(arr) || size <= 0) return [];
+    if (Array.isArray(arr) || size <= 0) return [];
     const out = [];
     for (let i = 0; i < arr.length; i += size) {
killedBy: ArrayUtils chunk works
statusReason: expected [] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] EqualityOperator
src/arrayUtils.js:33:32
   }
 
   static chunk(arr, size) {
-    if (!Array.isArray(arr) || size <= 0) return [];
+    if (!Array.isArray(arr) || size > 0) return [];
     const out = [];
     for (let i = 0; i < arr.length; i += size) {
killedBy: ArrayUtils chunk works
statusReason: expected [] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] ConditionalExpression
src/arrayUtils.js:35:21
   static chunk(arr, size) {
     if (!Array.isArray(arr) || size <= 0) return [];
     const out = [];
-    for (let i = 0; i < arr.length; i += size) {
+    for (let i = 0; false; i += size) {
       out.push(arr.slice(i, i + size));
     }
killedBy: ArrayUtils chunk works
statusReason: expected [] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] EqualityOperator
src/arrayUtils.js:35:21
   static chunk(arr, size) {
     if (!Array.isArray(arr) || size <= 0) return [];
     const out = [];
-    for (let i = 0; i < arr.length; i += size) {
+    for (let i = 0; i <= arr.length; i += size) {
       out.push(arr.slice(i, i + size));
     }
killedBy: ArrayUtils chunk works
statusReason: expected [ [ 1, 2 ], [ 3, 4 ], [] ] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] ArithmeticOperator
src/arrayUtils.js:36:29
     if (!Array.isArray(arr) || size <= 0) return [];
     const out = [];
     for (let i = 0; i < arr.length; i += size) {
-      out.push(arr.slice(i, i + size));
+      out.push(arr.slice(i, i - size));
     }
     return out;
killedBy: ArrayUtils chunk works
statusReason: expected [ [ 1, 2 ], [] ] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] MethodExpression
src/arrayUtils.js:36:16
     if (!Array.isArray(arr) || size <= 0) return [];
     const out = [];
     for (let i = 0; i < arr.length; i += size) {
-      out.push(arr.slice(i, i + size));
+      out.push(arr);
     }
     return out;
killedBy: ArrayUtils chunk works
statusReason: expected [ [ 1, 2, 3, 4 ], [ 1, 2, 3, 4 ] ] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]
