[Killed] BooleanLiteral
src/index.js:17:7
 
 // existing integration function
 function calculateAndFormatSummary(numbers, label) {
-  if (!Array.isArray(numbers)) {
+  if (Array.isArray(numbers)) {
     throw new Error('numbers must be an array');
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: numbers must be an array

[Killed] ConditionalExpression
src/index.js:17:7
 
 // existing integration function
 function calculateAndFormatSummary(numbers, label) {
-  if (!Array.isArray(numbers)) {
+  if (true) {
     throw new Error('numbers must be an array');
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: numbers must be an array

[NoCoverage] StringLiteral
src/index.js:18:21
 // existing integration function
 function calculateAndFormatSummary(numbers, label) {
   if (!Array.isArray(numbers)) {
-    throw new Error('numbers must be an array');
+    throw new Error("");
   }
 

[Killed] LogicalOperator
src/index.js:23:15
 
   const calc = new Calculator();
   const total = ArrayUtils.safeSum(numbers);
-  const avg = ArrayUtils.average(numbers) ?? 0;
+  const avg = ArrayUtils.average(numbers) && 0;
 
   const clampedAvg = MathUtils.clamp(avg, -1_000_000, 1_000_000);
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected +0 to equal 2

[Killed] UnaryOperator
src/index.js:25:43
   const total = ArrayUtils.safeSum(numbers);
   const avg = ArrayUtils.average(numbers) ?? 0;
 
-  const clampedAvg = MathUtils.clamp(avg, -1_000_000, 1_000_000);
+  const clampedAvg = MathUtils.clamp(avg, +1_000_000, 1_000_000);
   const isPrime = MathUtils.isPrime(Math.round(clampedAvg));
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 1000000 to equal 2

[Killed] ArrowFunction
src/index.js:31:31
   const cleanLabel = StringUtils.toTitleCase(label);
   const finalLabel = StringUtils.ensureSuffix(cleanLabel, ':');
 
-  const doubled = numbers.map(n =>
-    typeof n === 'number' ? calc.multiply(n, 2) : n
+  const doubled = numbers.map(() => undefined
   );
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ 2, 4, 6 ]

[Killed] EqualityOperator
src/index.js:32:5
   const finalLabel = StringUtils.ensureSuffix(cleanLabel, ':');
 
   const doubled = numbers.map(n =>
-    typeof n === 'number' ? calc.multiply(n, 2) : n
+    typeof n !== 'number' ? calc.multiply(n, 2) : n
   );
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 2, 4, 6 ]

[Killed] ConditionalExpression
src/index.js:32:5
   const finalLabel = StringUtils.ensureSuffix(cleanLabel, ':');
 
   const doubled = numbers.map(n =>
-    typeof n === 'number' ? calc.multiply(n, 2) : n
+    false ? calc.multiply(n, 2) : n
   );
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 2, 4, 6 ]

[Killed] ObjectLiteral
src/index.js:35:10
     typeof n === 'number' ? calc.multiply(n, 2) : n
   );
 
-  return {
-    label: finalLabel,
-    total,
-    average: clampedAvg,
-    isAveragePrime: isPrime,
-    doubled
-  };
+  return {};
 }
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected undefined to equal 6

[Killed] ObjectLiteral
src/index.js:44:18
   };
 }
 
-module.exports = {
-  // core modules
-  Calculator,
-  MathUtils,
-  StringUtils,
-  ArrayUtils,
-
-  // new utils
-  dateUtils,
-  searchUtils,
-  dataValidation,
-  statsUtils,
-  numberUtils,
-
-  // integration
-  calculateAndFormatSummary
-};
+module.exports = {};
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: calculateAndFormatSummary is not a function
