[Killed] BlockStatement
src/mathUtils.js:2:33
 class MathUtils {
-  static clamp(value, min, max) {
-    if (min > max) {
-      const t = min;
-      min = max;
-      max = t;
-    }
-
-    if (value < min) return min;
-    if (value > max) return max;
-    return value;
-  }
+  static clamp(value, min, max) {}
 
   static isPrime(n) {
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected undefined to equal 2

[Killed] ConditionalExpression
src/mathUtils.js:3:9
 class MathUtils {
   static clamp(value, min, max) {
-    if (min > max) {
+    if (true) {
       const t = min;
       min = max;
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 1000000 to equal 2

[Killed] EqualityOperator
src/mathUtils.js:3:9
 class MathUtils {
   static clamp(value, min, max) {
-    if (min > max) {
+    if (min <= max) {
       const t = min;
       min = max;
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 1000000 to equal 2

[Killed] ConditionalExpression
src/mathUtils.js:9:9
       max = t;
     }
 
-    if (value < min) return min;
+    if (true) return min;
     if (value > max) return max;
     return value;
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected -1000000 to equal 2

[Killed] ConditionalExpression
src/mathUtils.js:9:9
       max = t;
     }
 
-    if (value < min) return min;
+    if (false) return min;
     if (value > max) return max;
     return value;
killedBy: MathUtils clamp works correctly
statusReason: expected -5 to equal +0

[Killed] ConditionalExpression
src/mathUtils.js:10:9
     }
 
     if (value < min) return min;
-    if (value > max) return max;
+    if (true) return max;
     return value;
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 1000000 to equal 2

[Killed] EqualityOperator
src/mathUtils.js:10:9
     }
 
     if (value < min) return min;
-    if (value > max) return max;
+    if (value <= max) return max;
     return value;
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 1000000 to equal 2

[Killed] BlockStatement
src/mathUtils.js:14:21
     return value;
   }
 
-  static isPrime(n) {
-    if (typeof n !== 'number' || !Number.isInteger(n)) return false;
-    if (n <= 1) return false;
-    if (n === 2) return true;
-    if (n % 2 === 0) return false;
-
-    for (let i = 3; i * i <= n; i += 2) {
-      if (n % i === 0) return false;
-    }
-    return true;
-  }
+  static isPrime(n) {}
 
   static factorial(n) {
killedBy: MathUtils prime checking works
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
src/mathUtils.js:15:9
   }
 
   static isPrime(n) {
-    if (typeof n !== 'number' || !Number.isInteger(n)) return false;
+    if (true) return false;
     if (n <= 1) return false;
     if (n === 2) return true;
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] BooleanLiteral
src/mathUtils.js:15:34
   }
 
   static isPrime(n) {
-    if (typeof n !== 'number' || !Number.isInteger(n)) return false;
+    if (typeof n !== 'number' || Number.isInteger(n)) return false;
     if (n <= 1) return false;
     if (n === 2) return true;
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] EqualityOperator
src/mathUtils.js:16:9
 
   static isPrime(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return false;
-    if (n <= 1) return false;
+    if (n > 1) return false;
     if (n === 2) return true;
     if (n % 2 === 0) return false;
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/mathUtils.js:16:9
 
   static isPrime(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return false;
-    if (n <= 1) return false;
+    if (true) return false;
     if (n === 2) return true;
     if (n % 2 === 0) return false;
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/mathUtils.js:17:9
   static isPrime(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return false;
     if (n <= 1) return false;
-    if (n === 2) return true;
+    if (false) return true;
     if (n % 2 === 0) return false;
 
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/mathUtils.js:17:9
   static isPrime(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return false;
     if (n <= 1) return false;
-    if (n === 2) return true;
+    if (true) return true;
     if (n % 2 === 0) return false;
 
killedBy: MathUtils prime checking works
statusReason: expected true to equal false

[Killed] EqualityOperator
src/mathUtils.js:18:9
     if (typeof n !== 'number' || !Number.isInteger(n)) return false;
     if (n <= 1) return false;
     if (n === 2) return true;
-    if (n % 2 === 0) return false;
+    if (n % 2 !== 0) return false;
 
     for (let i = 3; i * i <= n; i += 2) {
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/mathUtils.js:18:9
     if (typeof n !== 'number' || !Number.isInteger(n)) return false;
     if (n <= 1) return false;
     if (n === 2) return true;
-    if (n % 2 === 0) return false;
+    if (true) return false;
 
     for (let i = 3; i * i <= n; i += 2) {
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] ArithmeticOperator
src/mathUtils.js:20:21
     if (n === 2) return true;
     if (n % 2 === 0) return false;
 
-    for (let i = 3; i * i <= n; i += 2) {
+    for (let i = 3; i / i <= n; i += 2) {
       if (n % i === 0) return false;
     }
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] AssignmentOperator
src/mathUtils.js:20:33
     if (n === 2) return true;
     if (n % 2 === 0) return false;
 
-    for (let i = 3; i * i <= n; i += 2) {
+    for (let i = 3; i * i <= n; i -= 2) {
       if (n % i === 0) return false;
     }
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/mathUtils.js:21:11
     if (n % 2 === 0) return false;
 
     for (let i = 3; i * i <= n; i += 2) {
-      if (n % i === 0) return false;
+      if (true) return false;
     }
     return true;
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] EqualityOperator
src/mathUtils.js:21:11
     if (n % 2 === 0) return false;
 
     for (let i = 3; i * i <= n; i += 2) {
-      if (n % i === 0) return false;
+      if (n % i !== 0) return false;
     }
     return true;
killedBy: MathUtils prime checking works
statusReason: expected false to equal true

[Killed] BlockStatement
src/mathUtils.js:26:23
     return true;
   }
 
-  static factorial(n) {
-    if (typeof n !== 'number' || !Number.isInteger(n)) return null;
-    if (n < 0) return null;
-    if (n === 0 || n === 1) return 1;
-
-    let result = 1;
-    for (let i = 2; i <= n; i++) {
-      result *= i;
-      if (!Number.isFinite(result)) return null;
-    }
-    return result;
-  }
+  static factorial(n) {}
 
   static gcd(a, b) {
killedBy: MathUtils factorial works
statusReason: expected undefined to equal 120

[Killed] EqualityOperator
src/mathUtils.js:27:9
   }
 
   static factorial(n) {
-    if (typeof n !== 'number' || !Number.isInteger(n)) return null;
+    if (typeof n === 'number' || !Number.isInteger(n)) return null;
     if (n < 0) return null;
     if (n === 0 || n === 1) return 1;
killedBy: MathUtils factorial works
statusReason: expected null to equal 120

[Killed] BooleanLiteral
src/mathUtils.js:27:34
   }
 
   static factorial(n) {
-    if (typeof n !== 'number' || !Number.isInteger(n)) return null;
+    if (typeof n !== 'number' || Number.isInteger(n)) return null;
     if (n < 0) return null;
     if (n === 0 || n === 1) return 1;
killedBy: MathUtils factorial works
statusReason: expected null to equal 120

[Killed] EqualityOperator
src/mathUtils.js:28:9
 
   static factorial(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return null;
-    if (n < 0) return null;
+    if (n <= 0) return null;
     if (n === 0 || n === 1) return 1;
 
killedBy: MathUtils factorial works
statusReason: expected null to equal 1

[Killed] ConditionalExpression
src/mathUtils.js:28:9
 
   static factorial(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return null;
-    if (n < 0) return null;
+    if (true) return null;
     if (n === 0 || n === 1) return 1;
 
killedBy: MathUtils factorial works
statusReason: expected null to equal 120

[Killed] ConditionalExpression
src/mathUtils.js:29:9
   static factorial(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return null;
     if (n < 0) return null;
-    if (n === 0 || n === 1) return 1;
+    if (true) return 1;
 
     let result = 1;
killedBy: MathUtils factorial works
statusReason: expected 1 to equal 120

[Killed] EqualityOperator
src/mathUtils.js:29:9
   static factorial(n) {
     if (typeof n !== 'number' || !Number.isInteger(n)) return null;
     if (n < 0) return null;
-    if (n === 0 || n === 1) return 1;
+    if (n !== 0 || n === 1) return 1;
 
     let result = 1;
killedBy: MathUtils factorial works
statusReason: expected 1 to equal 120

[Killed] BlockStatement
src/mathUtils.js:32:34
     if (n === 0 || n === 1) return 1;
 
     let result = 1;
-    for (let i = 2; i <= n; i++) {
-      result *= i;
-      if (!Number.isFinite(result)) return null;
-    }
+    for (let i = 2; i <= n; i++) {}
     return result;
   }
killedBy: MathUtils factorial works
statusReason: expected 1 to equal 120

[Killed] ConditionalExpression
src/mathUtils.js:34:11
     let result = 1;
     for (let i = 2; i <= n; i++) {
       result *= i;
-      if (!Number.isFinite(result)) return null;
+      if (true) return null;
     }
     return result;
killedBy: MathUtils factorial works
statusReason: expected null to equal 120

[Killed] BooleanLiteral
src/mathUtils.js:34:11
     let result = 1;
     for (let i = 2; i <= n; i++) {
       result *= i;
-      if (!Number.isFinite(result)) return null;
+      if (Number.isFinite(result)) return null;
     }
     return result;
killedBy: MathUtils factorial works
statusReason: expected null to equal 120

[Killed] BlockStatement
src/mathUtils.js:39:20
     return result;
   }
 
-  static gcd(a, b) {
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
-
-    a = Math.abs(a);
-    b = Math.abs(b);
-
-    if (a === 0 && b === 0) return null;
-    if (a === 0) return b;
-    if (b === 0) return a;
-
-    while (b !== 0) {
-      const t = b;
-      b = a % b;
-      a = t;
-    }
-    return a;
-  }
+  static gcd(a, b) {}
 
   static lcm(a, b) {
killedBy: MathUtils gcd works
statusReason: expected undefined to equal 6

[Killed] EqualityOperator
src/mathUtils.js:40:9
   }
 
   static gcd(a, b) {
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
+    if (typeof a === 'number' || typeof b !== 'number') return null;
 
     a = Math.abs(a);
killedBy: MathUtils gcd works
statusReason: expected null to equal 6

[Killed] ConditionalExpression
src/mathUtils.js:40:9
   }
 
   static gcd(a, b) {
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
+    if (true) return null;
 
     a = Math.abs(a);
killedBy: MathUtils gcd works
statusReason: expected null to equal 6

[Killed] ConditionalExpression
src/mathUtils.js:45:9
     a = Math.abs(a);
     b = Math.abs(b);
 
-    if (a === 0 && b === 0) return null;
+    if (true) return null;
     if (a === 0) return b;
     if (b === 0) return a;
killedBy: MathUtils gcd works
statusReason: expected null to equal 6

[Survived] EqualityOperator
src/mathUtils.js:45:9
     a = Math.abs(a);
     b = Math.abs(b);
 
-    if (a === 0 && b === 0) return null;
+    if (a !== 0 && b === 0) return null;
     if (a === 0) return b;
     if (b === 0) return a;

[Killed] EqualityOperator
src/mathUtils.js:46:9
     b = Math.abs(b);
 
     if (a === 0 && b === 0) return null;
-    if (a === 0) return b;
+    if (a !== 0) return b;
     if (b === 0) return a;
 
killedBy: MathUtils gcd works
statusReason: expected 18 to equal 6

[Killed] ConditionalExpression
src/mathUtils.js:46:9
     b = Math.abs(b);
 
     if (a === 0 && b === 0) return null;
-    if (a === 0) return b;
+    if (true) return b;
     if (b === 0) return a;
 
killedBy: MathUtils gcd works
statusReason: expected 18 to equal 6

[Killed] EqualityOperator
src/mathUtils.js:47:9
 
     if (a === 0 && b === 0) return null;
     if (a === 0) return b;
-    if (b === 0) return a;
+    if (b !== 0) return a;
 
     while (b !== 0) {
killedBy: MathUtils gcd works
statusReason: expected 12 to equal 6

[Killed] ConditionalExpression
src/mathUtils.js:47:9
 
     if (a === 0 && b === 0) return null;
     if (a === 0) return b;
-    if (b === 0) return a;
+    if (true) return a;
 
     while (b !== 0) {
killedBy: MathUtils gcd works
statusReason: expected 12 to equal 6

[Timeout] ArithmeticOperator
src/mathUtils.js:51:11
 
     while (b !== 0) {
       const t = b;
-      b = a % b;
+      b = a * b;
       a = t;
     }

[Killed] BlockStatement
src/mathUtils.js:57:20
     return a;
   }
 
-  static lcm(a, b) {
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
-
-    a = Math.abs(a);
-    b = Math.abs(b);
-
-    if (a === 0 || b === 0) return 0;
-
-    const g = this.gcd(a, b);
-    if (!g) return null;
-
-    const result = (a / g) * b;
-    return Number.isFinite(result) ? result : null;
-  }
+  static lcm(a, b) {}
 }
 
killedBy: MathUtils lcm works
statusReason: expected undefined to equal 12

[Killed] ConditionalExpression
src/mathUtils.js:58:9
   }
 
   static lcm(a, b) {
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
+    if (true) return null;
 
     a = Math.abs(a);
killedBy: MathUtils lcm works
statusReason: expected null to equal 12

[Killed] EqualityOperator
src/mathUtils.js:58:9
   }
 
   static lcm(a, b) {
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
+    if (typeof a === 'number' || typeof b !== 'number') return null;
 
     a = Math.abs(a);
killedBy: MathUtils lcm works
statusReason: expected null to equal 12

[Killed] EqualityOperator
src/mathUtils.js:63:20
     a = Math.abs(a);
     b = Math.abs(b);
 
-    if (a === 0 || b === 0) return 0;
+    if (a === 0 || b !== 0) return 0;
 
     const g = this.gcd(a, b);
killedBy: MathUtils lcm works
statusReason: expected +0 to equal 12

[Killed] ConditionalExpression
src/mathUtils.js:63:9
     a = Math.abs(a);
     b = Math.abs(b);
 
-    if (a === 0 || b === 0) return 0;
+    if (true) return 0;
 
     const g = this.gcd(a, b);
killedBy: MathUtils lcm works
statusReason: expected +0 to equal 12

[Killed] ConditionalExpression
src/mathUtils.js:66:9
     if (a === 0 || b === 0) return 0;
 
     const g = this.gcd(a, b);
-    if (!g) return null;
+    if (true) return null;
 
     const result = (a / g) * b;
killedBy: MathUtils lcm works
statusReason: expected null to equal 12

[Killed] BooleanLiteral
src/mathUtils.js:66:9
     if (a === 0 || b === 0) return 0;
 
     const g = this.gcd(a, b);
-    if (!g) return null;
+    if (g) return null;
 
     const result = (a / g) * b;
killedBy: MathUtils lcm works
statusReason: expected null to equal 12

[Killed] ArithmeticOperator
src/mathUtils.js:68:20
     const g = this.gcd(a, b);
     if (!g) return null;
 
-    const result = (a / g) * b;
+    const result = a / g / b;
     return Number.isFinite(result) ? result : null;
   }
killedBy: MathUtils lcm works
statusReason: expected 0.3333333333333333 to equal 12

[Killed] ArithmeticOperator
src/mathUtils.js:68:21
     const g = this.gcd(a, b);
     if (!g) return null;
 
-    const result = (a / g) * b;
+    const result = (a * g) * b;
     return Number.isFinite(result) ? result : null;
   }
killedBy: MathUtils lcm works
statusReason: expected 48 to equal 12
