[Killed] BlockStatement
src/stringUtils.js:2:22
 class StringUtils {
-  static safeTrim(v) {
-    if (typeof v !== 'string') return '';
-    return v.trim();
-  }
+  static safeTrim(v) {}
 
   static normalizeWhitespace(v) {
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/stringUtils.js:3:9
 class StringUtils {
   static safeTrim(v) {
-    if (typeof v !== 'string') return '';
+    if (true) return '';
     return v.trim();
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] EqualityOperator
src/stringUtils.js:3:9
 class StringUtils {
   static safeTrim(v) {
-    if (typeof v !== 'string') return '';
+    if (typeof v === 'string') return '';
     return v.trim();
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] MethodExpression
src/stringUtils.js:4:12
 class StringUtils {
   static safeTrim(v) {
     if (typeof v !== 'string') return '';
-    return v.trim();
+    return v;
   }
 
killedBy: StringUtils safeTrim
statusReason: expected '  hi  ' to equal 'hi'

[Killed] BlockStatement
src/stringUtils.js:7:33
     return v.trim();
   }
 
-  static normalizeWhitespace(v) {
-    const t = this.safeTrim(v);
-    return t === '' ? '' : t.replace(/\s+/g, ' ');
-  }
+  static normalizeWhitespace(v) {}
 
   static toTitleCase(v) {
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
src/stringUtils.js:9:12
 
   static normalizeWhitespace(v) {
     const t = this.safeTrim(v);
-    return t === '' ? '' : t.replace(/\s+/g, ' ');
+    return true ? '' : t.replace(/\s+/g, ' ');
   }
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] EqualityOperator
src/stringUtils.js:9:12
 
   static normalizeWhitespace(v) {
     const t = this.safeTrim(v);
-    return t === '' ? '' : t.replace(/\s+/g, ' ');
+    return t !== '' ? '' : t.replace(/\s+/g, ' ');
   }
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] BlockStatement
src/stringUtils.js:12:25
     return t === '' ? '' : t.replace(/\s+/g, ' ');
   }
 
-  static toTitleCase(v) {
-    const t = this.normalizeWhitespace(v);
-    if (t === '') return '';
-
-    return t
-      .split(' ')
-      .map(word => word[0].toUpperCase() + word.slice(1).toLowerCase())
-      .join(' ');
-  }
+  static toTitleCase(v) {}
 
   static ensureSuffix(v, suffix) {
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] EqualityOperator
src/stringUtils.js:14:9
 
   static toTitleCase(v) {
     const t = this.normalizeWhitespace(v);
-    if (t === '') return '';
+    if (t !== '') return '';
 
     return t
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] ConditionalExpression
src/stringUtils.js:14:9
 
   static toTitleCase(v) {
     const t = this.normalizeWhitespace(v);
-    if (t === '') return '';
+    if (true) return '';
 
     return t
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] MethodExpression
src/stringUtils.js:18:44
 
     return t
       .split(' ')
-      .map(word => word[0].toUpperCase() + word.slice(1).toLowerCase())
+      .map(word => word[0].toUpperCase() + word.slice(1).toUpperCase())
       .join(' ');
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 'SAMPLE LABEL:' to equal 'Sample Label:'

[Killed] ArrowFunction
src/stringUtils.js:18:12
 
     return t
       .split(' ')
-      .map(word => word[0].toUpperCase() + word.slice(1).toLowerCase())
+      .map(() => undefined)
       .join(' ');
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] StringLiteral
src/stringUtils.js:19:13
     return t
       .split(' ')
       .map(word => word[0].toUpperCase() + word.slice(1).toLowerCase())
-      .join(' ');
+      .join("");
   }
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 'SampleLabel:' to equal 'Sample Label:'

[Killed] BlockStatement
src/stringUtils.js:22:34
       .join(' ');
   }
 
-  static ensureSuffix(v, suffix) {
-    const t = this.safeTrim(v);
-    if (t === '') return suffix || '';
-    if (!suffix) return t;
-    if (t.endsWith(suffix)) return t;
-    return t + suffix;
-  }
+  static ensureSuffix(v, suffix) {}
 
   static maskSensitive(v, prefix = 2, suffix = 2) {
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected undefined to equal 'Sample Label:'

[Killed] EqualityOperator
src/stringUtils.js:24:9
 
   static ensureSuffix(v, suffix) {
     const t = this.safeTrim(v);
-    if (t === '') return suffix || '';
+    if (t !== '') return suffix || '';
     if (!suffix) return t;
     if (t.endsWith(suffix)) return t;
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] ConditionalExpression
src/stringUtils.js:24:9
 
   static ensureSuffix(v, suffix) {
     const t = this.safeTrim(v);
-    if (t === '') return suffix || '';
+    if (true) return suffix || '';
     if (!suffix) return t;
     if (t.endsWith(suffix)) return t;
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected ':' to equal 'Sample Label:'

[Killed] ConditionalExpression
src/stringUtils.js:25:9
   static ensureSuffix(v, suffix) {
     const t = this.safeTrim(v);
     if (t === '') return suffix || '';
-    if (!suffix) return t;
+    if (true) return t;
     if (t.endsWith(suffix)) return t;
     return t + suffix;
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 'Sample Label' to equal 'Sample Label:'

[Killed] BooleanLiteral
src/stringUtils.js:25:9
   static ensureSuffix(v, suffix) {
     const t = this.safeTrim(v);
     if (t === '') return suffix || '';
-    if (!suffix) return t;
+    if (suffix) return t;
     if (t.endsWith(suffix)) return t;
     return t + suffix;
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 'Sample Label' to equal 'Sample Label:'

[Killed] ConditionalExpression
src/stringUtils.js:26:9
     const t = this.safeTrim(v);
     if (t === '') return suffix || '';
     if (!suffix) return t;
-    if (t.endsWith(suffix)) return t;
+    if (true) return t;
     return t + suffix;
   }
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected 'Sample Label' to equal 'Sample Label:'

[Survived] ConditionalExpression
src/stringUtils.js:26:9
     const t = this.safeTrim(v);
     if (t === '') return suffix || '';
     if (!suffix) return t;
-    if (t.endsWith(suffix)) return t;
+    if (false) return t;
     return t + suffix;
   }

[Killed] ArithmeticOperator
src/stringUtils.js:27:12
     if (t === '') return suffix || '';
     if (!suffix) return t;
     if (t.endsWith(suffix)) return t;
-    return t + suffix;
+    return t - suffix;
   }
 
killedBy: Integration calculateAndFormatSummary works end-to-end
statusReason: expected NaN to equal 'Sample Label:'

[Killed] BlockStatement
src/stringUtils.js:30:51
     return t + suffix;
   }
 
-  static maskSensitive(v, prefix = 2, suffix = 2) {
-    const t = this.safeTrim(v);
-    const len = t.length;
-    if (len === 0) return '';
-    if (len <= prefix + suffix) return '*'.repeat(len);
-
-    const start = t.slice(0, prefix);
-    const end = t.slice(len - suffix);
-    const mid = '*'.repeat(len - prefix - suffix);
-    return start + mid + end;
-  }
+  static maskSensitive(v, prefix = 2, suffix = 2) {}
 }
 
killedBy: StringUtils maskSensitive
statusReason: expected undefined to equal 'ab**ef'

[Killed] ConditionalExpression
src/stringUtils.js:33:9
   static maskSensitive(v, prefix = 2, suffix = 2) {
     const t = this.safeTrim(v);
     const len = t.length;
-    if (len === 0) return '';
+    if (true) return '';
     if (len <= prefix + suffix) return '*'.repeat(len);
 
killedBy: StringUtils maskSensitive
statusReason: expected '' to equal 'ab**ef'

[Killed] EqualityOperator
src/stringUtils.js:33:9
   static maskSensitive(v, prefix = 2, suffix = 2) {
     const t = this.safeTrim(v);
     const len = t.length;
-    if (len === 0) return '';
+    if (len !== 0) return '';
     if (len <= prefix + suffix) return '*'.repeat(len);
 
killedBy: StringUtils maskSensitive
statusReason: expected '' to equal 'ab**ef'

[Killed] ConditionalExpression
src/stringUtils.js:34:9
     const t = this.safeTrim(v);
     const len = t.length;
     if (len === 0) return '';
-    if (len <= prefix + suffix) return '*'.repeat(len);
+    if (true) return '*'.repeat(len);
 
     const start = t.slice(0, prefix);
killedBy: StringUtils maskSensitive
statusReason: expected '******' to equal 'ab**ef'

[Killed] EqualityOperator
src/stringUtils.js:34:9
     const t = this.safeTrim(v);
     const len = t.length;
     if (len === 0) return '';
-    if (len <= prefix + suffix) return '*'.repeat(len);
+    if (len > prefix + suffix) return '*'.repeat(len);
 
     const start = t.slice(0, prefix);
killedBy: StringUtils maskSensitive
statusReason: expected '******' to equal 'ab**ef'

[Killed] MethodExpression
src/stringUtils.js:36:19
     if (len === 0) return '';
     if (len <= prefix + suffix) return '*'.repeat(len);
 
-    const start = t.slice(0, prefix);
+    const start = t;
     const end = t.slice(len - suffix);
     const mid = '*'.repeat(len - prefix - suffix);
killedBy: StringUtils maskSensitive
statusReason: expected 'abcdef**ef' to equal 'ab**ef'

[Killed] ArithmeticOperator
src/stringUtils.js:37:25
     if (len <= prefix + suffix) return '*'.repeat(len);
 
     const start = t.slice(0, prefix);
-    const end = t.slice(len - suffix);
+    const end = t.slice(len + suffix);
     const mid = '*'.repeat(len - prefix - suffix);
     return start + mid + end;
killedBy: StringUtils maskSensitive
statusReason: expected 'ab**' to equal 'ab**ef'

[Killed] MethodExpression
src/stringUtils.js:37:17
     if (len <= prefix + suffix) return '*'.repeat(len);
 
     const start = t.slice(0, prefix);
-    const end = t.slice(len - suffix);
+    const end = t;
     const mid = '*'.repeat(len - prefix - suffix);
     return start + mid + end;
killedBy: StringUtils maskSensitive
statusReason: expected 'ab**abcdef' to equal 'ab**ef'

[Killed] ArithmeticOperator
src/stringUtils.js:38:28
 
     const start = t.slice(0, prefix);
     const end = t.slice(len - suffix);
-    const mid = '*'.repeat(len - prefix - suffix);
+    const mid = '*'.repeat(len - prefix + suffix);
     return start + mid + end;
   }
killedBy: StringUtils maskSensitive
statusReason: expected 'ab******ef' to equal 'ab**ef'

[Killed] ArithmeticOperator
src/stringUtils.js:38:28
 
     const start = t.slice(0, prefix);
     const end = t.slice(len - suffix);
-    const mid = '*'.repeat(len - prefix - suffix);
+    const mid = '*'.repeat(len + prefix - suffix);
     return start + mid + end;
   }
killedBy: StringUtils maskSensitive
statusReason: expected 'ab******ef' to equal 'ab**ef'

[Killed] ArithmeticOperator
src/stringUtils.js:39:12
     const start = t.slice(0, prefix);
     const end = t.slice(len - suffix);
     const mid = '*'.repeat(len - prefix - suffix);
-    return start + mid + end;
+    return start + mid - end;
   }
 }
killedBy: StringUtils maskSensitive
statusReason: expected NaN to equal 'ab**ef'

[Killed] ArithmeticOperator
src/stringUtils.js:39:12
     const start = t.slice(0, prefix);
     const end = t.slice(len - suffix);
     const mid = '*'.repeat(len - prefix - suffix);
-    return start + mid + end;
+    return start - mid + end;
   }
 }
killedBy: StringUtils maskSensitive
statusReason: expected 'NaNef' to equal 'ab**ef'
