[Survived] Regex
src/utils/dataValidation.js:2:18
 // src/utils/dataValidation.js
-const EMAIL_RE = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const EMAIL_RE = /[^\s@]+@[^\s@]+\.[^\s@]+$/;
 const PHONE_RE = /^\+?[\d\s\-\(\).]{7,20}$/;
 

[Killed] Regex
src/utils/dataValidation.js:3:18
 // src/utils/dataValidation.js
 const EMAIL_RE = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-const PHONE_RE = /^\+?[\d\s\-\(\).]{7,20}$/;
+const PHONE_RE = /^\+?[\d\S\-\(\).]{7,20}$/;
 
 function isEmail(s) {
killedBy: dataValidation phone validator
statusReason: expected false to be true

[Killed] Regex
src/utils/dataValidation.js:3:18
 // src/utils/dataValidation.js
 const EMAIL_RE = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-const PHONE_RE = /^\+?[\d\s\-\(\).]{7,20}$/;
+const PHONE_RE = /^\+?[^\d\s\-\(\).]{7,20}$/;
 
 function isEmail(s) {
killedBy: dataValidation phone validator
statusReason: expected false to be true

[Killed] BlockStatement
src/utils/dataValidation.js:5:21
 const EMAIL_RE = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
 const PHONE_RE = /^\+?[\d\s\-\(\).]{7,20}$/;
 
-function isEmail(s) {
-  if (typeof s !== 'string') return false;
-  return EMAIL_RE.test(s.trim());
-}
+function isEmail(s) {}
 
 function isPhone(s) {
killedBy: dataValidation email validator
statusReason: expected undefined to be true

[Killed] EqualityOperator
src/utils/dataValidation.js:6:7
 const PHONE_RE = /^\+?[\d\s\-\(\).]{7,20}$/;
 
 function isEmail(s) {
-  if (typeof s !== 'string') return false;
+  if (typeof s === 'string') return false;
   return EMAIL_RE.test(s.trim());
 }
killedBy: dataValidation email validator
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/dataValidation.js:6:7
 const PHONE_RE = /^\+?[\d\s\-\(\).]{7,20}$/;
 
 function isEmail(s) {
-  if (typeof s !== 'string') return false;
+  if (true) return false;
   return EMAIL_RE.test(s.trim());
 }
killedBy: dataValidation email validator
statusReason: expected false to be true

[Survived] MethodExpression
src/utils/dataValidation.js:7:24
 
 function isEmail(s) {
   if (typeof s !== 'string') return false;
-  return EMAIL_RE.test(s.trim());
+  return EMAIL_RE.test(s);
 }
 

[Killed] BlockStatement
src/utils/dataValidation.js:10:21
   return EMAIL_RE.test(s.trim());
 }
 
-function isPhone(s) {
-  if (typeof s !== 'string' && typeof s !== 'number') return false;
-  return PHONE_RE.test(String(s).trim());
-}
+function isPhone(s) {}
 
 function sanitizeString(s) {
killedBy: dataValidation phone validator
statusReason: expected undefined to be true

[Killed] EqualityOperator
src/utils/dataValidation.js:11:7
 }
 
 function isPhone(s) {
-  if (typeof s !== 'string' && typeof s !== 'number') return false;
+  if (typeof s === 'string' && typeof s !== 'number') return false;
   return PHONE_RE.test(String(s).trim());
 }
killedBy: dataValidation phone validator
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/dataValidation.js:11:7
 }
 
 function isPhone(s) {
-  if (typeof s !== 'string' && typeof s !== 'number') return false;
+  if (true) return false;
   return PHONE_RE.test(String(s).trim());
 }
killedBy: dataValidation phone validator
statusReason: expected false to be true

[Survived] MethodExpression
src/utils/dataValidation.js:12:24
 
 function isPhone(s) {
   if (typeof s !== 'string' && typeof s !== 'number') return false;
-  return PHONE_RE.test(String(s).trim());
+  return PHONE_RE.test(String(s));
 }
 

[NoCoverage] BlockStatement
src/utils/dataValidation.js:15:28
   return PHONE_RE.test(String(s).trim());
 }
 
-function sanitizeString(s) {
-  if (s === null || s === undefined) return '';
-  return String(s).replace(/[<>]/g, (m) => (m === '<' ? '&lt;' : '&gt;'));
-}
+function sanitizeString(s) {}
 
 function safeJsonParse(s) {

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:16:7
 }
 
 function sanitizeString(s) {
-  if (s === null || s === undefined) return '';
+  if (true) return '';
   return String(s).replace(/[<>]/g, (m) => (m === '<' ? '&lt;' : '&gt;'));
 }

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:16:21
 }
 
 function sanitizeString(s) {
-  if (s === null || s === undefined) return '';
+  if (s === null || s !== undefined) return '';
   return String(s).replace(/[<>]/g, (m) => (m === '<' ? '&lt;' : '&gt;'));
 }

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:17:45
 
 function sanitizeString(s) {
   if (s === null || s === undefined) return '';
-  return String(s).replace(/[<>]/g, (m) => (m === '<' ? '&lt;' : '&gt;'));
+  return String(s).replace(/[<>]/g, (m) => (m !== '<' ? '&lt;' : '&gt;'));
 }
 

[NoCoverage] ArrowFunction
src/utils/dataValidation.js:17:37
 
 function sanitizeString(s) {
   if (s === null || s === undefined) return '';
-  return String(s).replace(/[<>]/g, (m) => (m === '<' ? '&lt;' : '&gt;'));
+  return String(s).replace(/[<>]/g, () => undefined);
 }
 

[Killed] BlockStatement
src/utils/dataValidation.js:20:27
   return String(s).replace(/[<>]/g, (m) => (m === '<' ? '&lt;' : '&gt;'));
 }
 
-function safeJsonParse(s) {
-  if (typeof s !== 'string') return { ok: false, error: 'not a string' };
-  try {
-    return { ok: true, value: JSON.parse(s) };
-  } catch (e) {
-    return { ok: false, error: e.message };
-  }
-}
+function safeJsonParse(s) {}
 
 function validateSchema(obj, schema) {
killedBy: dataValidation safeJsonParse
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/utils/dataValidation.js:21:7
 }
 
 function safeJsonParse(s) {
-  if (typeof s !== 'string') return { ok: false, error: 'not a string' };
+  if (typeof s === 'string') return { ok: false, error: 'not a string' };
   try {
     return { ok: true, value: JSON.parse(s) };
killedBy: dataValidation safeJsonParse
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/dataValidation.js:21:7
 }
 
 function safeJsonParse(s) {
-  if (typeof s !== 'string') return { ok: false, error: 'not a string' };
+  if (true) return { ok: false, error: 'not a string' };
   try {
     return { ok: true, value: JSON.parse(s) };
killedBy: dataValidation safeJsonParse
statusReason: expected false to be true

[Killed] BlockStatement
src/utils/dataValidation.js:22:7
 
 function safeJsonParse(s) {
   if (typeof s !== 'string') return { ok: false, error: 'not a string' };
-  try {
-    return { ok: true, value: JSON.parse(s) };
-  } catch (e) {
+  try {} catch (e) {
     return { ok: false, error: e.message };
   }
killedBy: dataValidation safeJsonParse
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BooleanLiteral
src/utils/dataValidation.js:23:18
 function safeJsonParse(s) {
   if (typeof s !== 'string') return { ok: false, error: 'not a string' };
   try {
-    return { ok: true, value: JSON.parse(s) };
+    return { ok: false, value: JSON.parse(s) };
   } catch (e) {
     return { ok: false, error: e.message };
killedBy: dataValidation safeJsonParse
statusReason: expected false to be true

[NoCoverage] BlockStatement
src/utils/dataValidation.js:24:15
   if (typeof s !== 'string') return { ok: false, error: 'not a string' };
   try {
     return { ok: true, value: JSON.parse(s) };
-  } catch (e) {
-    return { ok: false, error: e.message };
-  }
+  } catch (e) {}
 }
 

[NoCoverage] BooleanLiteral
src/utils/dataValidation.js:25:18
   try {
     return { ok: true, value: JSON.parse(s) };
   } catch (e) {
-    return { ok: false, error: e.message };
+    return { ok: true, error: e.message };
   }
 }

[NoCoverage] ArrayDeclaration
src/utils/dataValidation.js:30:18
 }
 
 function validateSchema(obj, schema) {
-  const errors = [];
+  const errors = ["Stryker was here"];
   if (typeof obj !== 'object' || obj === null) {
     errors.push('object expected');

[NoCoverage] BlockStatement
src/utils/dataValidation.js:31:48
 
 function validateSchema(obj, schema) {
   const errors = [];
-  if (typeof obj !== 'object' || obj === null) {
-    errors.push('object expected');
-    return { valid: false, errors };
-  }
+  if (typeof obj !== 'object' || obj === null) {}
   for (const k of Object.keys(schema)) {
     const rule = schema[k];

[NoCoverage] LogicalOperator
src/utils/dataValidation.js:31:7
 
 function validateSchema(obj, schema) {
   const errors = [];
-  if (typeof obj !== 'object' || obj === null) {
+  if (typeof obj !== 'object' && obj === null) {
     errors.push('object expected');
     return { valid: false, errors };

[NoCoverage] StringLiteral
src/utils/dataValidation.js:32:17
 function validateSchema(obj, schema) {
   const errors = [];
   if (typeof obj !== 'object' || obj === null) {
-    errors.push('object expected');
+    errors.push("");
     return { valid: false, errors };
   }

[NoCoverage] BooleanLiteral
src/utils/dataValidation.js:33:21
   const errors = [];
   if (typeof obj !== 'object' || obj === null) {
     errors.push('object expected');
-    return { valid: false, errors };
+    return { valid: true, errors };
   }
   for (const k of Object.keys(schema)) {

[NoCoverage] ObjectLiteral
src/utils/dataValidation.js:33:12
   const errors = [];
   if (typeof obj !== 'object' || obj === null) {
     errors.push('object expected');
-    return { valid: false, errors };
+    return {};
   }
   for (const k of Object.keys(schema)) {

[NoCoverage] BlockStatement
src/utils/dataValidation.js:35:40
     errors.push('object expected');
     return { valid: false, errors };
   }
-  for (const k of Object.keys(schema)) {
-    const rule = schema[k];
-    const val = obj[k];
-    if ((val === undefined || val === null) && rule.required) {
-      errors.push(`${k} is required`);
-      continue;
-    }
-    if (val === undefined || val === null) continue;
-    const t = Array.isArray(val) ? 'array' : typeof val;
-    if (rule.type && t !== rule.type) {
-      errors.push(`${k} expected ${rule.type} but got ${t}`);
-      continue;
-    }
-    if (rule.type === 'string') {
-      if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
-      if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
-    }
-    if (rule.type === 'number') {
-      if (rule.min !== undefined && val < rule.min) errors.push(`${k} < min`);
-      if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);
-    }
-  }
+  for (const k of Object.keys(schema)) {}
   return { valid: errors.length === 0, errors };
 }

[NoCoverage] LogicalOperator
src/utils/dataValidation.js:38:10
   for (const k of Object.keys(schema)) {
     const rule = schema[k];
     const val = obj[k];
-    if ((val === undefined || val === null) && rule.required) {
+    if ((val === undefined && val === null) && rule.required) {
       errors.push(`${k} is required`);
       continue;

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:38:10
   for (const k of Object.keys(schema)) {
     const rule = schema[k];
     const val = obj[k];
-    if ((val === undefined || val === null) && rule.required) {
+    if ((val !== undefined || val === null) && rule.required) {
       errors.push(`${k} is required`);
       continue;

[NoCoverage] StringLiteral
src/utils/dataValidation.js:39:19
     const rule = schema[k];
     const val = obj[k];
     if ((val === undefined || val === null) && rule.required) {
-      errors.push(`${k} is required`);
+      errors.push(``);
       continue;
     }

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:42:9
       errors.push(`${k} is required`);
       continue;
     }
-    if (val === undefined || val === null) continue;
+    if (val !== undefined || val === null) continue;
     const t = Array.isArray(val) ? 'array' : typeof val;
     if (rule.type && t !== rule.type) {

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:42:30
       errors.push(`${k} is required`);
       continue;
     }
-    if (val === undefined || val === null) continue;
+    if (val === undefined || val !== null) continue;
     const t = Array.isArray(val) ? 'array' : typeof val;
     if (rule.type && t !== rule.type) {

[NoCoverage] BlockStatement
src/utils/dataValidation.js:44:39
     }
     if (val === undefined || val === null) continue;
     const t = Array.isArray(val) ? 'array' : typeof val;
-    if (rule.type && t !== rule.type) {
-      errors.push(`${k} expected ${rule.type} but got ${t}`);
-      continue;
-    }
+    if (rule.type && t !== rule.type) {}
     if (rule.type === 'string') {
       if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:44:22
     }
     if (val === undefined || val === null) continue;
     const t = Array.isArray(val) ? 'array' : typeof val;
-    if (rule.type && t !== rule.type) {
+    if (rule.type && true) {
       errors.push(`${k} expected ${rule.type} but got ${t}`);
       continue;

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:48:9
       errors.push(`${k} expected ${rule.type} but got ${t}`);
       continue;
     }
-    if (rule.type === 'string') {
+    if (false) {
       if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:48:9
       errors.push(`${k} expected ${rule.type} but got ${t}`);
       continue;
     }
-    if (rule.type === 'string') {
+    if (true) {
       if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:49:40
       continue;
     }
     if (rule.type === 'string') {
-      if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
+      if (rule.minLen !== undefined && val.length <= rule.minLen) errors.push(`${k} too short`);
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
     }

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:49:11
       continue;
     }
     if (rule.type === 'string') {
-      if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
+      if (true) errors.push(`${k} too short`);
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
     }

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:50:40
     }
     if (rule.type === 'string') {
       if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
-      if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
+      if (rule.maxLen !== undefined && val.length >= rule.maxLen) errors.push(`${k} too long`);
     }
     if (rule.type === 'number') {

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:50:11
     }
     if (rule.type === 'string') {
       if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
-      if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
+      if (true) errors.push(`${k} too long`);
     }
     if (rule.type === 'number') {

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:52:9
       if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
     }
-    if (rule.type === 'number') {
+    if (true) {
       if (rule.min !== undefined && val < rule.min) errors.push(`${k} < min`);
       if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:52:9
       if (rule.minLen !== undefined && val.length < rule.minLen) errors.push(`${k} too short`);
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
     }
-    if (rule.type === 'number') {
+    if (false) {
       if (rule.min !== undefined && val < rule.min) errors.push(`${k} < min`);
       if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:53:11
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
     }
     if (rule.type === 'number') {
-      if (rule.min !== undefined && val < rule.min) errors.push(`${k} < min`);
+      if (false) errors.push(`${k} < min`);
       if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);
     }

[NoCoverage] LogicalOperator
src/utils/dataValidation.js:53:11
       if (rule.maxLen !== undefined && val.length > rule.maxLen) errors.push(`${k} too long`);
     }
     if (rule.type === 'number') {
-      if (rule.min !== undefined && val < rule.min) errors.push(`${k} < min`);
+      if (rule.min !== undefined || val < rule.min) errors.push(`${k} < min`);
       if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);
     }

[NoCoverage] EqualityOperator
src/utils/dataValidation.js:54:11
     }
     if (rule.type === 'number') {
       if (rule.min !== undefined && val < rule.min) errors.push(`${k} < min`);
-      if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);
+      if (rule.max === undefined && val > rule.max) errors.push(`${k} > max`);
     }
   }

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:54:11
     }
     if (rule.type === 'number') {
       if (rule.min !== undefined && val < rule.min) errors.push(`${k} < min`);
-      if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);
+      if (true) errors.push(`${k} > max`);
     }
   }

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:57:19
       if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);
     }
   }
-  return { valid: errors.length === 0, errors };
+  return { valid: true, errors };
 }
 

[NoCoverage] ConditionalExpression
src/utils/dataValidation.js:57:19
       if (rule.max !== undefined && val > rule.max) errors.push(`${k} > max`);
     }
   }
-  return { valid: errors.length === 0, errors };
+  return { valid: false, errors };
 }
 

[Killed] ObjectLiteral
src/utils/dataValidation.js:60:18
   return { valid: errors.length === 0, errors };
 }
 
-module.exports = {
-  isEmail,
-  isPhone,
-  sanitizeString,
-  safeJsonParse,
-  validateSchema
-};
+module.exports = {};
 
killedBy: dataValidation email validator
statusReason: v.isEmail is not a function
