[Killed] ArrayDeclaration
src/utils/dateUtils.js:2:23
 // src/utils/dateUtils.js
-const DAYS_IN_MONTH = [31,28,31,30,31,30,31,31,30,31,30,31];
+const DAYS_IN_MONTH = [];
 
 function isLeapYear(year) {
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-03' to equal '2025-02-28'

[Survived] BlockStatement
src/utils/dateUtils.js:4:27
 // src/utils/dateUtils.js
 const DAYS_IN_MONTH = [31,28,31,30,31,30,31,31,30,31,30,31];
 
-function isLeapYear(year) {
-  if (!Number.isInteger(year)) return false;
-  if (year % 400 === 0) return true;
-  if (year % 100 === 0) return false;
-  return year % 4 === 0;
-}
+function isLeapYear(year) {}
 
 function parseDate(input) {

[Survived] ConditionalExpression
src/utils/dateUtils.js:5:7
 const DAYS_IN_MONTH = [31,28,31,30,31,30,31,31,30,31,30,31];
 
 function isLeapYear(year) {
-  if (!Number.isInteger(year)) return false;
+  if (true) return false;
   if (year % 400 === 0) return true;
   if (year % 100 === 0) return false;

[NoCoverage] BooleanLiteral
src/utils/dateUtils.js:5:39
 const DAYS_IN_MONTH = [31,28,31,30,31,30,31,31,30,31,30,31];
 
 function isLeapYear(year) {
-  if (!Number.isInteger(year)) return false;
+  if (!Number.isInteger(year)) return true;
   if (year % 400 === 0) return true;
   if (year % 100 === 0) return false;

[Killed] EqualityOperator
src/utils/dateUtils.js:6:7
 
 function isLeapYear(year) {
   if (!Number.isInteger(year)) return false;
-  if (year % 400 === 0) return true;
+  if (year % 400 !== 0) return true;
   if (year % 100 === 0) return false;
   return year % 4 === 0;
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-01' to equal '2025-02-28'

[Killed] ConditionalExpression
src/utils/dateUtils.js:6:7
 
 function isLeapYear(year) {
   if (!Number.isInteger(year)) return false;
-  if (year % 400 === 0) return true;
+  if (true) return true;
   if (year % 100 === 0) return false;
   return year % 4 === 0;
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-01' to equal '2025-02-28'

[Survived] ConditionalExpression
src/utils/dateUtils.js:7:7
 function isLeapYear(year) {
   if (!Number.isInteger(year)) return false;
   if (year % 400 === 0) return true;
-  if (year % 100 === 0) return false;
+  if (false) return false;
   return year % 4 === 0;
 }

[Survived] EqualityOperator
src/utils/dateUtils.js:7:7
 function isLeapYear(year) {
   if (!Number.isInteger(year)) return false;
   if (year % 400 === 0) return true;
-  if (year % 100 === 0) return false;
+  if (year % 100 !== 0) return false;
   return year % 4 === 0;
 }

[Killed] ConditionalExpression
src/utils/dateUtils.js:8:10
   if (!Number.isInteger(year)) return false;
   if (year % 400 === 0) return true;
   if (year % 100 === 0) return false;
-  return year % 4 === 0;
+  return true;
 }
 
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-01' to equal '2025-02-28'

[Killed] EqualityOperator
src/utils/dateUtils.js:8:10
   if (!Number.isInteger(year)) return false;
   if (year % 400 === 0) return true;
   if (year % 100 === 0) return false;
-  return year % 4 === 0;
+  return year % 4 !== 0;
 }
 
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-01' to equal '2025-02-28'

[Killed] EqualityOperator
src/utils/dateUtils.js:12:25
 }
 
 function parseDate(input) {
-  if (input === null || input === undefined) return null;
+  if (input === null || input !== undefined) return null;
   if (input instanceof Date) {
     const d = new Date(input.getTime());
killedBy: dateUtils parses ISO and formats
statusReason: expected null to not equal null

[Killed] ConditionalExpression
src/utils/dateUtils.js:12:7
 }
 
 function parseDate(input) {
-  if (input === null || input === undefined) return null;
+  if (true) return null;
   if (input instanceof Date) {
     const d = new Date(input.getTime());
killedBy: dateUtils parses ISO and formats
statusReason: expected null to not equal null

[Killed] ConditionalExpression
src/utils/dateUtils.js:13:7
 
 function parseDate(input) {
   if (input === null || input === undefined) return null;
-  if (input instanceof Date) {
+  if (true) {
     const d = new Date(input.getTime());
     return isNaN(d.getTime()) ? null : d;
killedBy: dateUtils parses ISO and formats
statusReason: input.getTime is not a function

[Killed] BlockStatement
src/utils/dateUtils.js:13:30
 
 function parseDate(input) {
   if (input === null || input === undefined) return null;
-  if (input instanceof Date) {
-    const d = new Date(input.getTime());
-    return isNaN(d.getTime()) ? null : d;
-  }
+  if (input instanceof Date) {}
   if (typeof input === 'number') {
     const d = new Date(input);
killedBy: dateUtils add months handles end of month
statusReason: expected null to equal '2025-02-28'

[Survived] ConditionalExpression
src/utils/dateUtils.js:17:7
     const d = new Date(input.getTime());
     return isNaN(d.getTime()) ? null : d;
   }
-  if (typeof input === 'number') {
+  if (false) {
     const d = new Date(input);
     return isNaN(d.getTime()) ? null : d;

[Survived] ConditionalExpression
src/utils/dateUtils.js:17:7
     const d = new Date(input.getTime());
     return isNaN(d.getTime()) ? null : d;
   }
-  if (typeof input === 'number') {
+  if (true) {
     const d = new Date(input);
     return isNaN(d.getTime()) ? null : d;

[Killed] ConditionalExpression
src/utils/dateUtils.js:21:7
     const d = new Date(input);
     return isNaN(d.getTime()) ? null : d;
   }
-  if (typeof input !== 'string') return null;
+  if (true) return null;
   const s = input.trim();
   let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
killedBy: dateUtils parses ISO and formats
statusReason: expected null to not equal null

[Killed] EqualityOperator
src/utils/dateUtils.js:21:7
     const d = new Date(input);
     return isNaN(d.getTime()) ? null : d;
   }
-  if (typeof input !== 'string') return null;
+  if (typeof input === 'string') return null;
   const s = input.trim();
   let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
killedBy: dateUtils parses ISO and formats
statusReason: expected null to not equal null

[Survived] MethodExpression
src/utils/dateUtils.js:22:13
     return isNaN(d.getTime()) ? null : d;
   }
   if (typeof input !== 'string') return null;
-  const s = input.trim();
+  const s = input;
   let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
   if (m) {

[Survived] Regex
src/utils/dateUtils.js:23:19
   }
   if (typeof input !== 'string') return null;
   const s = input.trim();
-  let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
+  let m = s.match(/^(\d)[\/-](\d{1,2})[\/-](\d{1,2})$/);
   if (m) {
     const y = Number(m[1]), mo = Number(m[2]), da = Number(m[3]);

[Survived] Regex
src/utils/dateUtils.js:23:19
   }
   if (typeof input !== 'string') return null;
   const s = input.trim();
-  let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
+  let m = s.match(/(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
   if (m) {
     const y = Number(m[1]), mo = Number(m[2]), da = Number(m[3]);

[Survived] ConditionalExpression
src/utils/dateUtils.js:24:7
   if (typeof input !== 'string') return null;
   const s = input.trim();
   let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
-  if (m) {
+  if (true) {
     const y = Number(m[1]), mo = Number(m[2]), da = Number(m[3]);
     const dt = new Date(Date.UTC(y, mo - 1, da));

[Survived] ConditionalExpression
src/utils/dateUtils.js:24:7
   if (typeof input !== 'string') return null;
   const s = input.trim();
   let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
-  if (m) {
+  if (false) {
     const y = Number(m[1]), mo = Number(m[2]), da = Number(m[3]);
     const dt = new Date(Date.UTC(y, mo - 1, da));

[Killed] ArithmeticOperator
src/utils/dateUtils.js:26:37
   let m = s.match(/^(\d{4})[\/-](\d{1,2})[\/-](\d{1,2})$/);
   if (m) {
     const y = Number(m[1]), mo = Number(m[2]), da = Number(m[3]);
-    const dt = new Date(Date.UTC(y, mo - 1, da));
+    const dt = new Date(Date.UTC(y, mo + 1, da));
     return isNaN(dt.getTime()) ? null : dt;
   }
killedBy: dateUtils parses ISO and formats
statusReason: expected '2026-01-23' to equal '2025-11-23'

[NoCoverage] Regex
src/utils/dateUtils.js:29:15
     const dt = new Date(Date.UTC(y, mo - 1, da));
     return isNaN(dt.getTime()) ? null : dt;
   }
-  m = s.match(/^(\d{1,2})\/(\d{1,2})\/(\d{4})$/);
+  m = s.match(/^(\D{1,2})\/(\d{1,2})\/(\d{4})$/);
   if (m) {
     const da = Number(m[1]), mo = Number(m[2]), y = Number(m[3]);

[NoCoverage] Regex
src/utils/dateUtils.js:29:15
     const dt = new Date(Date.UTC(y, mo - 1, da));
     return isNaN(dt.getTime()) ? null : dt;
   }
-  m = s.match(/^(\d{1,2})\/(\d{1,2})\/(\d{4})$/);
+  m = s.match(/^(\d{1,2})\/(\d{1,2})\/(\d)$/);
   if (m) {
     const da = Number(m[1]), mo = Number(m[2]), y = Number(m[3]);

[NoCoverage] BlockStatement
src/utils/dateUtils.js:30:10
     return isNaN(dt.getTime()) ? null : dt;
   }
   m = s.match(/^(\d{1,2})\/(\d{1,2})\/(\d{4})$/);
-  if (m) {
-    const da = Number(m[1]), mo = Number(m[2]), y = Number(m[3]);
-    const dt = new Date(Date.UTC(y, mo - 1, da));
-    return isNaN(dt.getTime()) ? null : dt;
-  }
+  if (m) {}
   const fallback = new Date(s);
   return isNaN(fallback.getTime()) ? null : fallback;

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:30:7
     return isNaN(dt.getTime()) ? null : dt;
   }
   m = s.match(/^(\d{1,2})\/(\d{1,2})\/(\d{4})$/);
-  if (m) {
+  if (true) {
     const da = Number(m[1]), mo = Number(m[2]), y = Number(m[3]);
     const dt = new Date(Date.UTC(y, mo - 1, da));

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:32:37
   m = s.match(/^(\d{1,2})\/(\d{1,2})\/(\d{4})$/);
   if (m) {
     const da = Number(m[1]), mo = Number(m[2]), y = Number(m[3]);
-    const dt = new Date(Date.UTC(y, mo - 1, da));
+    const dt = new Date(Date.UTC(y, mo + 1, da));
     return isNaN(dt.getTime()) ? null : dt;
   }

[Killed] BlockStatement
src/utils/dateUtils.js:39:47
   return isNaN(fallback.getTime()) ? null : fallback;
 }
 
-function formatDate(date, fmt = 'YYYY-MM-DD') {
-  const d = (date instanceof Date) ? new Date(date.getTime()) : parseDate(date);
-  if (!d) return null;
-  const Y = d.getUTCFullYear();
-  const M = d.getUTCMonth() + 1;
-  const D = d.getUTCDate();
-  const hh = d.getUTCHours();
-  const mm = d.getUTCMinutes();
-  const ss = d.getUTCSeconds();
-  const pad = (n, w = 2) => String(n).padStart(w, '0');
-  return fmt
-    .replace('YYYY', String(Y))
-    .replace('MM', pad(M))
-    .replace('DD', pad(D))
-    .replace('hh', pad(hh))
-    .replace('mm', pad(mm))
-    .replace('ss', pad(ss));
-}
+function formatDate(date, fmt = 'YYYY-MM-DD') {}
 
 function diffInDays(a, b) {
killedBy: dateUtils parses ISO and formats
statusReason: expected undefined to equal '2025-11-23'

[Killed] ConditionalExpression
src/utils/dateUtils.js:41:7
 
 function formatDate(date, fmt = 'YYYY-MM-DD') {
   const d = (date instanceof Date) ? new Date(date.getTime()) : parseDate(date);
-  if (!d) return null;
+  if (true) return null;
   const Y = d.getUTCFullYear();
   const M = d.getUTCMonth() + 1;
killedBy: dateUtils parses ISO and formats
statusReason: expected null to equal '2025-11-23'

[Killed] BooleanLiteral
src/utils/dateUtils.js:41:7
 
 function formatDate(date, fmt = 'YYYY-MM-DD') {
   const d = (date instanceof Date) ? new Date(date.getTime()) : parseDate(date);
-  if (!d) return null;
+  if (d) return null;
   const Y = d.getUTCFullYear();
   const M = d.getUTCMonth() + 1;
killedBy: dateUtils parses ISO and formats
statusReason: expected null to equal '2025-11-23'

[Killed] ArithmeticOperator
src/utils/dateUtils.js:43:13
   const d = (date instanceof Date) ? new Date(date.getTime()) : parseDate(date);
   if (!d) return null;
   const Y = d.getUTCFullYear();
-  const M = d.getUTCMonth() + 1;
+  const M = d.getUTCMonth() - 1;
   const D = d.getUTCDate();
   const hh = d.getUTCHours();
killedBy: dateUtils parses ISO and formats
statusReason: expected '2025-09-23' to equal '2025-11-23'

[Killed] ArrowFunction
src/utils/dateUtils.js:48:15
   const hh = d.getUTCHours();
   const mm = d.getUTCMinutes();
   const ss = d.getUTCSeconds();
-  const pad = (n, w = 2) => String(n).padStart(w, '0');
+  const pad = () => undefined;
   return fmt
     .replace('YYYY', String(Y))
killedBy: dateUtils parses ISO and formats
statusReason: expected '2025-undefined-undefined' to equal '2025-11-23'

[Killed] StringLiteral
src/utils/dateUtils.js:51:14
   const pad = (n, w = 2) => String(n).padStart(w, '0');
   return fmt
     .replace('YYYY', String(Y))
-    .replace('MM', pad(M))
+    .replace("", pad(M))
     .replace('DD', pad(D))
     .replace('hh', pad(hh))
killedBy: dateUtils parses ISO and formats
statusReason: expected '112025-MM-23' to equal '2025-11-23'

[Killed] StringLiteral
src/utils/dateUtils.js:53:14
     .replace('YYYY', String(Y))
     .replace('MM', pad(M))
     .replace('DD', pad(D))
-    .replace('hh', pad(hh))
+    .replace("", pad(hh))
     .replace('mm', pad(mm))
     .replace('ss', pad(ss));
killedBy: dateUtils parses ISO and formats
statusReason: expected '002025-11-23' to equal '2025-11-23'

[Killed] BlockStatement
src/utils/dateUtils.js:58:27
     .replace('ss', pad(ss));
 }
 
-function diffInDays(a, b) {
-  const da = parseDate(a);
-  const db = parseDate(b);
-  if (!da || !db) return null;
-  const ms = da.getTime() - db.getTime();
-  return ms / (1000 * 60 * 60 * 24);
-}
+function diffInDays(a, b) {}
 
 function add(date, { days = 0, months = 0, years = 0 } = {}) {
killedBy: dateUtils diffInDays simple
statusReason: expected undefined to equal 1

[Killed] ConditionalExpression
src/utils/dateUtils.js:61:7
 function diffInDays(a, b) {
   const da = parseDate(a);
   const db = parseDate(b);
-  if (!da || !db) return null;
+  if (true) return null;
   const ms = da.getTime() - db.getTime();
   return ms / (1000 * 60 * 60 * 24);
killedBy: dateUtils diffInDays simple
statusReason: expected null to equal 1

[Killed] BooleanLiteral
src/utils/dateUtils.js:61:14
 function diffInDays(a, b) {
   const da = parseDate(a);
   const db = parseDate(b);
-  if (!da || !db) return null;
+  if (!da || db) return null;
   const ms = da.getTime() - db.getTime();
   return ms / (1000 * 60 * 60 * 24);
killedBy: dateUtils diffInDays simple
statusReason: expected null to equal 1

[Killed] ArithmeticOperator
src/utils/dateUtils.js:62:14
   const da = parseDate(a);
   const db = parseDate(b);
   if (!da || !db) return null;
-  const ms = da.getTime() - db.getTime();
+  const ms = da.getTime() + db.getTime();
   return ms / (1000 * 60 * 60 * 24);
 }
killedBy: dateUtils diffInDays simple
statusReason: expected 40829 to equal 1

[Killed] ArithmeticOperator
src/utils/dateUtils.js:63:10
   const db = parseDate(b);
   if (!da || !db) return null;
   const ms = da.getTime() - db.getTime();
-  return ms / (1000 * 60 * 60 * 24);
+  return ms * (1000 * 60 * 60 * 24);
 }
 
killedBy: dateUtils diffInDays simple
statusReason: expected 7464960000000000 to equal 1

[Killed] ArithmeticOperator
src/utils/dateUtils.js:63:16
   const db = parseDate(b);
   if (!da || !db) return null;
   const ms = da.getTime() - db.getTime();
-  return ms / (1000 * 60 * 60 * 24);
+  return ms / (1000 / 60 * 60 * 24);
 }
 
killedBy: dateUtils diffInDays simple
statusReason: expected 3599.9999999999995 to equal 1

[Killed] BlockStatement
src/utils/dateUtils.js:66:62
   return ms / (1000 * 60 * 60 * 24);
 }
 
-function add(date, { days = 0, months = 0, years = 0 } = {}) {
-  const d = parseDate(date);
-  if (!d) return null;
-  let year = d.getUTCFullYear() + Number(years);
-  let month = d.getUTCMonth() + Number(months);
-  let day = d.getUTCDate() + Number(days);
-  year += Math.floor(month / 12);
-  month = ((month % 12) + 12) % 12;
-  let maxDay = DAYS_IN_MONTH[month];
-  if (month === 1 && isLeapYear(year)) maxDay = 29;
-  if (day > maxDay) day = maxDay;
-  if (day < 1) day = 1;
-  return new Date(Date.UTC(year, month, day, d.getUTCHours(), d.getUTCMinutes(), d.getUTCSeconds()));
-}
+function add(date, { days = 0, months = 0, years = 0 } = {}) {}
 
 function humanDiff(a, b) {
killedBy: dateUtils add months handles end of month
statusReason: expected null to equal '2025-02-28'

[Killed] ConditionalExpression
src/utils/dateUtils.js:68:7
 
 function add(date, { days = 0, months = 0, years = 0 } = {}) {
   const d = parseDate(date);
-  if (!d) return null;
+  if (true) return null;
   let year = d.getUTCFullYear() + Number(years);
   let month = d.getUTCMonth() + Number(months);
killedBy: dateUtils add months handles end of month
statusReason: expected null to equal '2025-02-28'

[Killed] BooleanLiteral
src/utils/dateUtils.js:68:7
 
 function add(date, { days = 0, months = 0, years = 0 } = {}) {
   const d = parseDate(date);
-  if (!d) return null;
+  if (d) return null;
   let year = d.getUTCFullYear() + Number(years);
   let month = d.getUTCMonth() + Number(months);
killedBy: dateUtils add months handles end of month
statusReason: expected null to equal '2025-02-28'

[Survived] ArithmeticOperator
src/utils/dateUtils.js:69:14
 function add(date, { days = 0, months = 0, years = 0 } = {}) {
   const d = parseDate(date);
   if (!d) return null;
-  let year = d.getUTCFullYear() + Number(years);
+  let year = d.getUTCFullYear() - Number(years);
   let month = d.getUTCMonth() + Number(months);
   let day = d.getUTCDate() + Number(days);

[Killed] ArithmeticOperator
src/utils/dateUtils.js:70:15
   const d = parseDate(date);
   if (!d) return null;
   let year = d.getUTCFullYear() + Number(years);
-  let month = d.getUTCMonth() + Number(months);
+  let month = d.getUTCMonth() - Number(months);
   let day = d.getUTCDate() + Number(days);
   year += Math.floor(month / 12);
killedBy: dateUtils add months handles end of month
statusReason: expected '2024-12-31' to equal '2025-02-28'

[Survived] ArithmeticOperator
src/utils/dateUtils.js:71:13
   if (!d) return null;
   let year = d.getUTCFullYear() + Number(years);
   let month = d.getUTCMonth() + Number(months);
-  let day = d.getUTCDate() + Number(days);
+  let day = d.getUTCDate() - Number(days);
   year += Math.floor(month / 12);
   month = ((month % 12) + 12) % 12;

[Killed] ArithmeticOperator
src/utils/dateUtils.js:72:22
   let year = d.getUTCFullYear() + Number(years);
   let month = d.getUTCMonth() + Number(months);
   let day = d.getUTCDate() + Number(days);
-  year += Math.floor(month / 12);
+  year += Math.floor(month * 12);
   month = ((month % 12) + 12) % 12;
   let maxDay = DAYS_IN_MONTH[month];
killedBy: dateUtils add months handles end of month
statusReason: expected '2037-02-28' to equal '2025-02-28'

[Survived] AssignmentOperator
src/utils/dateUtils.js:72:3
   let year = d.getUTCFullYear() + Number(years);
   let month = d.getUTCMonth() + Number(months);
   let day = d.getUTCDate() + Number(days);
-  year += Math.floor(month / 12);
+  year -= Math.floor(month / 12);
   month = ((month % 12) + 12) % 12;
   let maxDay = DAYS_IN_MONTH[month];

[Killed] ArithmeticOperator
src/utils/dateUtils.js:73:12
   let month = d.getUTCMonth() + Number(months);
   let day = d.getUTCDate() + Number(days);
   year += Math.floor(month / 12);
-  month = ((month % 12) + 12) % 12;
+  month = (month % 12 - 12) % 12;
   let maxDay = DAYS_IN_MONTH[month];
   if (month === 1 && isLeapYear(year)) maxDay = 29;
killedBy: dateUtils add months handles end of month
statusReason: expected '2024-03-02' to equal '2025-02-28'

[Killed] ArithmeticOperator
src/utils/dateUtils.js:73:11
   let month = d.getUTCMonth() + Number(months);
   let day = d.getUTCDate() + Number(days);
   year += Math.floor(month / 12);
-  month = ((month % 12) + 12) % 12;
+  month = (month % 12 + 12) * 12;
   let maxDay = DAYS_IN_MONTH[month];
   if (month === 1 && isLeapYear(year)) maxDay = 29;
killedBy: dateUtils add months handles end of month
statusReason: expected '2038-01-31' to equal '2025-02-28'

[Killed] LogicalOperator
src/utils/dateUtils.js:75:7
   year += Math.floor(month / 12);
   month = ((month % 12) + 12) % 12;
   let maxDay = DAYS_IN_MONTH[month];
-  if (month === 1 && isLeapYear(year)) maxDay = 29;
+  if (month === 1 || isLeapYear(year)) maxDay = 29;
   if (day > maxDay) day = maxDay;
   if (day < 1) day = 1;
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-01' to equal '2025-02-28'

[Killed] ConditionalExpression
src/utils/dateUtils.js:75:7
   year += Math.floor(month / 12);
   month = ((month % 12) + 12) % 12;
   let maxDay = DAYS_IN_MONTH[month];
-  if (month === 1 && isLeapYear(year)) maxDay = 29;
+  if (true) maxDay = 29;
   if (day > maxDay) day = maxDay;
   if (day < 1) day = 1;
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-01' to equal '2025-02-28'

[Killed] EqualityOperator
src/utils/dateUtils.js:76:7
   month = ((month % 12) + 12) % 12;
   let maxDay = DAYS_IN_MONTH[month];
   if (month === 1 && isLeapYear(year)) maxDay = 29;
-  if (day > maxDay) day = maxDay;
+  if (day <= maxDay) day = maxDay;
   if (day < 1) day = 1;
   return new Date(Date.UTC(year, month, day, d.getUTCHours(), d.getUTCMinutes(), d.getUTCSeconds()));
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-03' to equal '2025-02-28'

[Killed] ConditionalExpression
src/utils/dateUtils.js:76:7
   month = ((month % 12) + 12) % 12;
   let maxDay = DAYS_IN_MONTH[month];
   if (month === 1 && isLeapYear(year)) maxDay = 29;
-  if (day > maxDay) day = maxDay;
+  if (false) day = maxDay;
   if (day < 1) day = 1;
   return new Date(Date.UTC(year, month, day, d.getUTCHours(), d.getUTCMinutes(), d.getUTCSeconds()));
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-03-03' to equal '2025-02-28'

[Killed] ConditionalExpression
src/utils/dateUtils.js:77:7
   let maxDay = DAYS_IN_MONTH[month];
   if (month === 1 && isLeapYear(year)) maxDay = 29;
   if (day > maxDay) day = maxDay;
-  if (day < 1) day = 1;
+  if (true) day = 1;
   return new Date(Date.UTC(year, month, day, d.getUTCHours(), d.getUTCMinutes(), d.getUTCSeconds()));
 }
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-02-01' to equal '2025-02-28'

[Killed] EqualityOperator
src/utils/dateUtils.js:77:7
   let maxDay = DAYS_IN_MONTH[month];
   if (month === 1 && isLeapYear(year)) maxDay = 29;
   if (day > maxDay) day = maxDay;
-  if (day < 1) day = 1;
+  if (day >= 1) day = 1;
   return new Date(Date.UTC(year, month, day, d.getUTCHours(), d.getUTCMinutes(), d.getUTCSeconds()));
 }
killedBy: dateUtils add months handles end of month
statusReason: expected '2025-02-01' to equal '2025-02-28'

[NoCoverage] BlockStatement
src/utils/dateUtils.js:81:26
   return new Date(Date.UTC(year, month, day, d.getUTCHours(), d.getUTCMinutes(), d.getUTCSeconds()));
 }
 
-function humanDiff(a, b) {
-  const da = parseDate(a);
-  const db = parseDate(b);
-  if (!da || !db) return null;
-  let sign = 1;
-  let x = new Date(da.getTime()), y = new Date(db.getTime());
-  if (x < y) { sign = -1; [x, y] = [y, x]; }
-  let years = x.getUTCFullYear() - y.getUTCFullYear();
-  let months = x.getUTCMonth() - y.getUTCMonth();
-  let days = x.getUTCDate() - y.getUTCDate();
-  if (days < 0) {
-    months -= 1;
-    const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
-    const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
-    let maxDay = DAYS_IN_MONTH[prevMonth];
-    if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;
-    days += maxDay;
-  }
-  if (months < 0) { months += 12; years -= 1; }
-  return { years: years * sign, months: months * sign, days: days * sign };
-}
+function humanDiff(a, b) {}
 
 function parseDuration(s) {

[NoCoverage] LogicalOperator
src/utils/dateUtils.js:84:7
 function humanDiff(a, b) {
   const da = parseDate(a);
   const db = parseDate(b);
-  if (!da || !db) return null;
+  if (!da && !db) return null;
   let sign = 1;
   let x = new Date(da.getTime()), y = new Date(db.getTime());

[NoCoverage] UnaryOperator
src/utils/dateUtils.js:87:23
   if (!da || !db) return null;
   let sign = 1;
   let x = new Date(da.getTime()), y = new Date(db.getTime());
-  if (x < y) { sign = -1; [x, y] = [y, x]; }
+  if (x < y) { sign = +1; [x, y] = [y, x]; }
   let years = x.getUTCFullYear() - y.getUTCFullYear();
   let months = x.getUTCMonth() - y.getUTCMonth();

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:87:7
   if (!da || !db) return null;
   let sign = 1;
   let x = new Date(da.getTime()), y = new Date(db.getTime());
-  if (x < y) { sign = -1; [x, y] = [y, x]; }
+  if (false) { sign = -1; [x, y] = [y, x]; }
   let years = x.getUTCFullYear() - y.getUTCFullYear();
   let months = x.getUTCMonth() - y.getUTCMonth();

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:88:15
   let sign = 1;
   let x = new Date(da.getTime()), y = new Date(db.getTime());
   if (x < y) { sign = -1; [x, y] = [y, x]; }
-  let years = x.getUTCFullYear() - y.getUTCFullYear();
+  let years = x.getUTCFullYear() + y.getUTCFullYear();
   let months = x.getUTCMonth() - y.getUTCMonth();
   let days = x.getUTCDate() - y.getUTCDate();

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:89:16
   let x = new Date(da.getTime()), y = new Date(db.getTime());
   if (x < y) { sign = -1; [x, y] = [y, x]; }
   let years = x.getUTCFullYear() - y.getUTCFullYear();
-  let months = x.getUTCMonth() - y.getUTCMonth();
+  let months = x.getUTCMonth() + y.getUTCMonth();
   let days = x.getUTCDate() - y.getUTCDate();
   if (days < 0) {

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:90:14
   if (x < y) { sign = -1; [x, y] = [y, x]; }
   let years = x.getUTCFullYear() - y.getUTCFullYear();
   let months = x.getUTCMonth() - y.getUTCMonth();
-  let days = x.getUTCDate() - y.getUTCDate();
+  let days = x.getUTCDate() + y.getUTCDate();
   if (days < 0) {
     months -= 1;

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:91:7
   let years = x.getUTCFullYear() - y.getUTCFullYear();
   let months = x.getUTCMonth() - y.getUTCMonth();
   let days = x.getUTCDate() - y.getUTCDate();
-  if (days < 0) {
+  if (false) {
     months -= 1;
     const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;

[NoCoverage] BlockStatement
src/utils/dateUtils.js:91:17
   let years = x.getUTCFullYear() - y.getUTCFullYear();
   let months = x.getUTCMonth() - y.getUTCMonth();
   let days = x.getUTCDate() - y.getUTCDate();
-  if (days < 0) {
-    months -= 1;
-    const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
-    const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
-    let maxDay = DAYS_IN_MONTH[prevMonth];
-    if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;
-    days += maxDay;
-  }
+  if (days < 0) {}
   if (months < 0) { months += 12; years -= 1; }
   return { years: years * sign, months: months * sign, days: days * sign };

[NoCoverage] AssignmentOperator
src/utils/dateUtils.js:92:5
   let months = x.getUTCMonth() - y.getUTCMonth();
   let days = x.getUTCDate() - y.getUTCDate();
   if (days < 0) {
-    months -= 1;
+    months += 1;
     const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
     const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:93:24
   let days = x.getUTCDate() - y.getUTCDate();
   if (days < 0) {
     months -= 1;
-    const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
+    const prevMonth = (x.getUTCMonth() + 1 + 12) % 12;
     const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
     let maxDay = DAYS_IN_MONTH[prevMonth];

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:93:24
   let days = x.getUTCDate() - y.getUTCDate();
   if (days < 0) {
     months -= 1;
-    const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
+    const prevMonth = (x.getUTCMonth() - 1 - 12) % 12;
     const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
     let maxDay = DAYS_IN_MONTH[prevMonth];

[NoCoverage] EqualityOperator
src/utils/dateUtils.js:94:25
   if (days < 0) {
     months -= 1;
     const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
-    const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
+    const yearForPrev = x.getUTCMonth() !== 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
     let maxDay = DAYS_IN_MONTH[prevMonth];
     if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:94:49
   if (days < 0) {
     months -= 1;
     const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
-    const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
+    const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() + 1 : x.getUTCFullYear();
     let maxDay = DAYS_IN_MONTH[prevMonth];
     if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;

[NoCoverage] LogicalOperator
src/utils/dateUtils.js:96:9
     const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
     const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
     let maxDay = DAYS_IN_MONTH[prevMonth];
-    if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;
+    if (prevMonth === 1 || isLeapYear(yearForPrev)) maxDay = 29;
     days += maxDay;
   }

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:96:9
     const prevMonth = (x.getUTCMonth() - 1 + 12) % 12;
     const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
     let maxDay = DAYS_IN_MONTH[prevMonth];
-    if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;
+    if (true) maxDay = 29;
     days += maxDay;
   }
