[NoCoverage] AssignmentOperator
src/utils/dateUtils.js:97:5
     const yearForPrev = x.getUTCMonth() === 0 ? x.getUTCFullYear() - 1 : x.getUTCFullYear();
     let maxDay = DAYS_IN_MONTH[prevMonth];
     if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;
-    days += maxDay;
+    days -= maxDay;
   }
   if (months < 0) { months += 12; years -= 1; }

[NoCoverage] EqualityOperator
src/utils/dateUtils.js:99:7
     if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;
     days += maxDay;
   }
-  if (months < 0) { months += 12; years -= 1; }
+  if (months <= 0) { months += 12; years -= 1; }
   return { years: years * sign, months: months * sign, days: days * sign };
 }

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:99:7
     if (prevMonth === 1 && isLeapYear(yearForPrev)) maxDay = 29;
     days += maxDay;
   }
-  if (months < 0) { months += 12; years -= 1; }
+  if (true) { months += 12; years -= 1; }
   return { years: years * sign, months: months * sign, days: days * sign };
 }

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:100:19
     days += maxDay;
   }
   if (months < 0) { months += 12; years -= 1; }
-  return { years: years * sign, months: months * sign, days: days * sign };
+  return { years: years / sign, months: months * sign, days: days * sign };
 }
 

[NoCoverage] ArithmeticOperator
src/utils/dateUtils.js:100:41
     days += maxDay;
   }
   if (months < 0) { months += 12; years -= 1; }
-  return { years: years * sign, months: months * sign, days: days * sign };
+  return { years: years * sign, months: months / sign, days: days * sign };
 }
 

[NoCoverage] BlockStatement
src/utils/dateUtils.js:103:27
   return { years: years * sign, months: months * sign, days: days * sign };
 }
 
-function parseDuration(s) {
-  if (!s || typeof s !== 'string') return null;
-  const input = s.toLowerCase();
-  const out = { years: 0, months: 0, days: 0 };
-  const re = /(-?\d+)\s*(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;
-  let m;
-  while ((m = re.exec(input))) {
-    const n = Number(m[1]); const u = m[2];
-    if (/^y/.test(u)) out.years += n;
-    else if (/^mo|^m$/.test(u)) out.months += n;
-    else if (/^d/.test(u)) out.days += n;
-  }
-  return out;
-}
+function parseDuration(s) {}
 
 module.exports = {

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:104:7
 }
 
 function parseDuration(s) {
-  if (!s || typeof s !== 'string') return null;
+  if (false) return null;
   const input = s.toLowerCase();
   const out = { years: 0, months: 0, days: 0 };

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:104:7
 }
 
 function parseDuration(s) {
-  if (!s || typeof s !== 'string') return null;
+  if (true) return null;
   const input = s.toLowerCase();
   const out = { years: 0, months: 0, days: 0 };

[NoCoverage] MethodExpression
src/utils/dateUtils.js:105:17
 
 function parseDuration(s) {
   if (!s || typeof s !== 'string') return null;
-  const input = s.toLowerCase();
+  const input = s.toUpperCase();
   const out = { years: 0, months: 0, days: 0 };
   const re = /(-?\d+)\s*(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;

[NoCoverage] Regex
src/utils/dateUtils.js:107:14
   if (!s || typeof s !== 'string') return null;
   const input = s.toLowerCase();
   const out = { years: 0, months: 0, days: 0 };
-  const re = /(-?\d+)\s*(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;
+  const re = /(-?\d+)\s(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;
   let m;
   while ((m = re.exec(input))) {

[NoCoverage] Regex
src/utils/dateUtils.js:107:14
   if (!s || typeof s !== 'string') return null;
   const input = s.toLowerCase();
   const out = { years: 0, months: 0, days: 0 };
-  const re = /(-?\d+)\s*(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;
+  const re = /(-?\D+)\s*(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;
   let m;
   while ((m = re.exec(input))) {

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:109:11
   const out = { years: 0, months: 0, days: 0 };
   const re = /(-?\d+)\s*(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;
   let m;
-  while ((m = re.exec(input))) {
+  while ((false)) {
     const n = Number(m[1]); const u = m[2];
     if (/^y/.test(u)) out.years += n;

[NoCoverage] BlockStatement
src/utils/dateUtils.js:109:32
   const out = { years: 0, months: 0, days: 0 };
   const re = /(-?\d+)\s*(y|yr|yrs|year|years|mo|m|month|months|d|day|days)/g;
   let m;
-  while ((m = re.exec(input))) {
-    const n = Number(m[1]); const u = m[2];
-    if (/^y/.test(u)) out.years += n;
-    else if (/^mo|^m$/.test(u)) out.months += n;
-    else if (/^d/.test(u)) out.days += n;
-  }
+  while ((m = re.exec(input))) {}
   return out;
 }

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:111:9
   let m;
   while ((m = re.exec(input))) {
     const n = Number(m[1]); const u = m[2];
-    if (/^y/.test(u)) out.years += n;
+    if (false) out.years += n;
     else if (/^mo|^m$/.test(u)) out.months += n;
     else if (/^d/.test(u)) out.days += n;

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:111:9
   let m;
   while ((m = re.exec(input))) {
     const n = Number(m[1]); const u = m[2];
-    if (/^y/.test(u)) out.years += n;
+    if (true) out.years += n;
     else if (/^mo|^m$/.test(u)) out.months += n;
     else if (/^d/.test(u)) out.days += n;

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:112:14
   while ((m = re.exec(input))) {
     const n = Number(m[1]); const u = m[2];
     if (/^y/.test(u)) out.years += n;
-    else if (/^mo|^m$/.test(u)) out.months += n;
+    else if (false) out.months += n;
     else if (/^d/.test(u)) out.days += n;
   }

[NoCoverage] AssignmentOperator
src/utils/dateUtils.js:112:33
   while ((m = re.exec(input))) {
     const n = Number(m[1]); const u = m[2];
     if (/^y/.test(u)) out.years += n;
-    else if (/^mo|^m$/.test(u)) out.months += n;
+    else if (/^mo|^m$/.test(u)) out.months -= n;
     else if (/^d/.test(u)) out.days += n;
   }

[NoCoverage] ConditionalExpression
src/utils/dateUtils.js:113:14
     const n = Number(m[1]); const u = m[2];
     if (/^y/.test(u)) out.years += n;
     else if (/^mo|^m$/.test(u)) out.months += n;
-    else if (/^d/.test(u)) out.days += n;
+    else if (false) out.days += n;
   }
   return out;

[NoCoverage] AssignmentOperator
src/utils/dateUtils.js:113:28
     const n = Number(m[1]); const u = m[2];
     if (/^y/.test(u)) out.years += n;
     else if (/^mo|^m$/.test(u)) out.months += n;
-    else if (/^d/.test(u)) out.days += n;
+    else if (/^d/.test(u)) out.days -= n;
   }
   return out;

[Killed] ObjectLiteral
src/utils/dateUtils.js:118:18
   return out;
 }
 
-module.exports = {
-  parseDate,
-  formatDate,
-  diffInDays,
-  add,
-  humanDiff,
-  parseDuration,
-  isLeapYear
-};
+module.exports = {};
 
killedBy: dateUtils parses ISO and formats
statusReason: du.parseDate is not a function
