[Killed] BlockStatement
src/utils/numberUtils.js:4:31
 // src/utils/numberUtils.js
 // General numeric utilities: rounding, clamping, conversions, randomness, hashing, stats, sequences.
 
-function clamp(num, min, max) {
-  const n = Number(num);
-  if (!Number.isFinite(n)) return NaN;
-  return Math.min(Math.max(n, min), max);
-}
+function clamp(num, min, max) {}
 
 function roundTo(num, decimals = 0) {
killedBy: numberUtils clamp works
statusReason: expected undefined to equal 5

[Killed] BooleanLiteral
src/utils/numberUtils.js:6:7
 
 function clamp(num, min, max) {
   const n = Number(num);
-  if (!Number.isFinite(n)) return NaN;
+  if (Number.isFinite(n)) return NaN;
   return Math.min(Math.max(n, min), max);
 }
killedBy: numberUtils clamp works
statusReason: expected NaN to equal 5

[Killed] ConditionalExpression
src/utils/numberUtils.js:6:7
 
 function clamp(num, min, max) {
   const n = Number(num);
-  if (!Number.isFinite(n)) return NaN;
+  if (true) return NaN;
   return Math.min(Math.max(n, min), max);
 }
killedBy: numberUtils clamp works
statusReason: expected NaN to equal 5

[Killed] MethodExpression
src/utils/numberUtils.js:7:19
 function clamp(num, min, max) {
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
-  return Math.min(Math.max(n, min), max);
+  return Math.min(Math.min(n, min), max);
 }
 
killedBy: numberUtils clamp works
statusReason: expected +0 to equal 5

[Killed] MethodExpression
src/utils/numberUtils.js:7:10
 function clamp(num, min, max) {
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
-  return Math.min(Math.max(n, min), max);
+  return Math.max(Math.max(n, min), max);
 }
 
killedBy: numberUtils clamp works
statusReason: expected 10 to equal 5

[Killed] BlockStatement
src/utils/numberUtils.js:10:37
   return Math.min(Math.max(n, min), max);
 }
 
-function roundTo(num, decimals = 0) {
-  const n = Number(num);
-  if (!Number.isFinite(n)) return NaN;
-  const factor = Math.pow(10, decimals);
-  return Math.round(n * factor) / factor;
-}
+function roundTo(num, decimals = 0) {}
 
 function floorTo(num, decimals = 0) {
killedBy: numberUtils rounding functions
statusReason: expected undefined to equal 1.23

[Killed] ArithmeticOperator
src/utils/numberUtils.js:14:10
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const factor = Math.pow(10, decimals);
-  return Math.round(n * factor) / factor;
+  return Math.round(n * factor) * factor;
 }
 
killedBy: numberUtils rounding functions
statusReason: expected 12300 to equal 1.23

[Killed] ArithmeticOperator
src/utils/numberUtils.js:14:21
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const factor = Math.pow(10, decimals);
-  return Math.round(n * factor) / factor;
+  return Math.round(n / factor) / factor;
 }
 
killedBy: numberUtils rounding functions
statusReason: expected +0 to equal 1.23

[Killed] BlockStatement
src/utils/numberUtils.js:17:37
   return Math.round(n * factor) / factor;
 }
 
-function floorTo(num, decimals = 0) {
-  const n = Number(num);
-  if (!Number.isFinite(n)) return NaN;
-  const factor = Math.pow(10, decimals);
-  return Math.floor(n * factor) / factor;
-}
+function floorTo(num, decimals = 0) {}
 
 function ceilTo(num, decimals = 0) {
killedBy: numberUtils rounding functions
statusReason: expected undefined to equal 1

[Survived] ArithmeticOperator
src/utils/numberUtils.js:21:21
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const factor = Math.pow(10, decimals);
-  return Math.floor(n * factor) / factor;
+  return Math.floor(n / factor) / factor;
 }
 

[Survived] ArithmeticOperator
src/utils/numberUtils.js:21:10
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const factor = Math.pow(10, decimals);
-  return Math.floor(n * factor) / factor;
+  return Math.floor(n * factor) * factor;
 }
 

[Killed] BlockStatement
src/utils/numberUtils.js:24:36
   return Math.floor(n * factor) / factor;
 }
 
-function ceilTo(num, decimals = 0) {
-  const n = Number(num);
-  if (!Number.isFinite(n)) return NaN;
-  const factor = Math.pow(10, decimals);
-  return Math.ceil(n * factor) / factor;
-}
+function ceilTo(num, decimals = 0) {}
 
 // convert string "123.45" -> 123.45, or return defaultValue
killedBy: numberUtils rounding functions
statusReason: expected undefined to equal 2

[Survived] ArithmeticOperator
src/utils/numberUtils.js:28:20
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const factor = Math.pow(10, decimals);
-  return Math.ceil(n * factor) / factor;
+  return Math.ceil(n / factor) / factor;
 }
 

[Survived] ArithmeticOperator
src/utils/numberUtils.js:28:10
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const factor = Math.pow(10, decimals);
-  return Math.ceil(n * factor) / factor;
+  return Math.ceil(n * factor) * factor;
 }
 

[Killed] BlockStatement
src/utils/numberUtils.js:32:48
 }
 
 // convert string "123.45" -> 123.45, or return defaultValue
-function safeParseFloat(s, defaultValue = NaN) {
-  if (typeof s === 'number') return s;
-  if (typeof s !== 'string') return defaultValue;
-  const n = parseFloat(s.trim());
-  return Number.isFinite(n) ? n : defaultValue;
-}
+function safeParseFloat(s, defaultValue = NaN) {}
 
 // convert to integer safely
killedBy: numberUtils safe parsing
statusReason: expected undefined to equal 12.5

[Killed] EqualityOperator
src/utils/numberUtils.js:33:7
 
 // convert string "123.45" -> 123.45, or return defaultValue
 function safeParseFloat(s, defaultValue = NaN) {
-  if (typeof s === 'number') return s;
+  if (typeof s !== 'number') return s;
   if (typeof s !== 'string') return defaultValue;
   const n = parseFloat(s.trim());
killedBy: numberUtils safe parsing
statusReason: expected 'abc' to be NaN

[Killed] ConditionalExpression
src/utils/numberUtils.js:33:7
 
 // convert string "123.45" -> 123.45, or return defaultValue
 function safeParseFloat(s, defaultValue = NaN) {
-  if (typeof s === 'number') return s;
+  if (true) return s;
   if (typeof s !== 'string') return defaultValue;
   const n = parseFloat(s.trim());
killedBy: numberUtils safe parsing
statusReason: expected 'abc' to be NaN

[Killed] EqualityOperator
src/utils/numberUtils.js:34:7
 // convert string "123.45" -> 123.45, or return defaultValue
 function safeParseFloat(s, defaultValue = NaN) {
   if (typeof s === 'number') return s;
-  if (typeof s !== 'string') return defaultValue;
+  if (typeof s === 'string') return defaultValue;
   const n = parseFloat(s.trim());
   return Number.isFinite(n) ? n : defaultValue;
killedBy: numberUtils safe parsing
statusReason: expected NaN to equal 12.5

[Killed] ConditionalExpression
src/utils/numberUtils.js:34:7
 // convert string "123.45" -> 123.45, or return defaultValue
 function safeParseFloat(s, defaultValue = NaN) {
   if (typeof s === 'number') return s;
-  if (typeof s !== 'string') return defaultValue;
+  if (true) return defaultValue;
   const n = parseFloat(s.trim());
   return Number.isFinite(n) ? n : defaultValue;
killedBy: numberUtils safe parsing
statusReason: expected NaN to equal 12.5

[Survived] MethodExpression
src/utils/numberUtils.js:35:24
 function safeParseFloat(s, defaultValue = NaN) {
   if (typeof s === 'number') return s;
   if (typeof s !== 'string') return defaultValue;
-  const n = parseFloat(s.trim());
+  const n = parseFloat(s);
   return Number.isFinite(n) ? n : defaultValue;
 }

[Killed] BlockStatement
src/utils/numberUtils.js:40:46
 }
 
 // convert to integer safely
-function safeParseInt(s, defaultValue = NaN) {
-  if (typeof s === 'number') return Math.trunc(s);
-  if (typeof s !== 'string') return defaultValue;
-  const n = parseInt(s.trim(), 10);
-  return Number.isFinite(n) ? n : defaultValue;
-}
+function safeParseInt(s, defaultValue = NaN) {}
 
 // convert degrees to radians
killedBy: numberUtils safe parsing
statusReason: expected undefined to equal 42

[Survived] ConditionalExpression
src/utils/numberUtils.js:41:7
 
 // convert to integer safely
 function safeParseInt(s, defaultValue = NaN) {
-  if (typeof s === 'number') return Math.trunc(s);
+  if (true) return Math.trunc(s);
   if (typeof s !== 'string') return defaultValue;
   const n = parseInt(s.trim(), 10);

[Survived] EqualityOperator
src/utils/numberUtils.js:41:7
 
 // convert to integer safely
 function safeParseInt(s, defaultValue = NaN) {
-  if (typeof s === 'number') return Math.trunc(s);
+  if (typeof s !== 'number') return Math.trunc(s);
   if (typeof s !== 'string') return defaultValue;
   const n = parseInt(s.trim(), 10);

[Killed] EqualityOperator
src/utils/numberUtils.js:42:7
 // convert to integer safely
 function safeParseInt(s, defaultValue = NaN) {
   if (typeof s === 'number') return Math.trunc(s);
-  if (typeof s !== 'string') return defaultValue;
+  if (typeof s === 'string') return defaultValue;
   const n = parseInt(s.trim(), 10);
   return Number.isFinite(n) ? n : defaultValue;
killedBy: numberUtils safe parsing
statusReason: expected NaN to equal 42

[Killed] ConditionalExpression
src/utils/numberUtils.js:42:7
 // convert to integer safely
 function safeParseInt(s, defaultValue = NaN) {
   if (typeof s === 'number') return Math.trunc(s);
-  if (typeof s !== 'string') return defaultValue;
+  if (true) return defaultValue;
   const n = parseInt(s.trim(), 10);
   return Number.isFinite(n) ? n : defaultValue;
killedBy: numberUtils safe parsing
statusReason: expected NaN to equal 42

[Survived] MethodExpression
src/utils/numberUtils.js:43:22
 function safeParseInt(s, defaultValue = NaN) {
   if (typeof s === 'number') return Math.trunc(s);
   if (typeof s !== 'string') return defaultValue;
-  const n = parseInt(s.trim(), 10);
+  const n = parseInt(s, 10);
   return Number.isFinite(n) ? n : defaultValue;
 }

[Killed] BlockStatement
src/utils/numberUtils.js:48:24
 }
 
 // convert degrees to radians
-function degToRad(deg) {
-  const n = Number(deg);
-  return Number.isFinite(n) ? (n * Math.PI) / 180 : NaN;
-}
+function degToRad(deg) {}
 
 // convert radians to degrees
killedBy: numberUtils conversions deg/rad
statusReason: expected undefined to be a number

[Killed] ArithmeticOperator
src/utils/numberUtils.js:50:31
 // convert degrees to radians
 function degToRad(deg) {
   const n = Number(deg);
-  return Number.isFinite(n) ? (n * Math.PI) / 180 : NaN;
+  return Number.isFinite(n) ? n * Math.PI * 180 : NaN;
 }
 
killedBy: numberUtils conversions deg/rad
statusReason: expected 101787.6019763093 to be close to 3.141592653589793 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/numberUtils.js:50:32
 // convert degrees to radians
 function degToRad(deg) {
   const n = Number(deg);
-  return Number.isFinite(n) ? (n * Math.PI) / 180 : NaN;
+  return Number.isFinite(n) ? (n / Math.PI) / 180 : NaN;
 }
 
killedBy: numberUtils conversions deg/rad
statusReason: expected 0.3183098861837907 to be close to 3.141592653589793 +/- 1e-10

[Killed] BlockStatement
src/utils/numberUtils.js:54:24
 }
 
 // convert radians to degrees
-function radToDeg(rad) {
-  const n = Number(rad);
-  return Number.isFinite(n) ? (n * 180) / Math.PI : NaN;
-}
+function radToDeg(rad) {}
 
 // get random float in range
killedBy: numberUtils conversions deg/rad
statusReason: expected undefined to be a number

[Killed] ArithmeticOperator
src/utils/numberUtils.js:56:32
 // convert radians to degrees
 function radToDeg(rad) {
   const n = Number(rad);
-  return Number.isFinite(n) ? (n * 180) / Math.PI : NaN;
+  return Number.isFinite(n) ? (n / 180) / Math.PI : NaN;
 }
 
killedBy: numberUtils conversions deg/rad
statusReason: expected 0.005555555555555556 to be close to 180 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/numberUtils.js:56:31
 // convert radians to degrees
 function radToDeg(rad) {
   const n = Number(rad);
-  return Number.isFinite(n) ? (n * 180) / Math.PI : NaN;
+  return Number.isFinite(n) ? n * 180 * Math.PI : NaN;
 }
 
killedBy: numberUtils conversions deg/rad
statusReason: expected 1776.5287921960844 to be close to 180 +/- 1e-10

[NoCoverage] BlockStatement
src/utils/numberUtils.js:60:40
 }
 
 // get random float in range
-function randomFloat(min = 0, max = 1) {
-  if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  return Math.random() * (max - min) + min;
-}
+function randomFloat(min = 0, max = 1) {}
 
 // get random integer inclusive

[NoCoverage] BooleanLiteral
src/utils/numberUtils.js:61:32
 
 // get random float in range
 function randomFloat(min = 0, max = 1) {
-  if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
+  if (!Number.isFinite(min) || Number.isFinite(max)) return NaN;
   return Math.random() * (max - min) + min;
 }

[NoCoverage] LogicalOperator
src/utils/numberUtils.js:61:7
 
 // get random float in range
 function randomFloat(min = 0, max = 1) {
-  if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
+  if (!Number.isFinite(min) && !Number.isFinite(max)) return NaN;
   return Math.random() * (max - min) + min;
 }

[NoCoverage] ArithmeticOperator
src/utils/numberUtils.js:62:27
 // get random float in range
 function randomFloat(min = 0, max = 1) {
   if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  return Math.random() * (max - min) + min;
+  return Math.random() * (max + min) + min;
 }
 

[NoCoverage] ArithmeticOperator
src/utils/numberUtils.js:62:10
 // get random float in range
 function randomFloat(min = 0, max = 1) {
   if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  return Math.random() * (max - min) + min;
+  return Math.random() * (max - min) - min;
 }
 

[Killed] BlockStatement
src/utils/numberUtils.js:66:30
 }
 
 // get random integer inclusive
-function randomInt(min, max) {
-  min = Math.ceil(min);
-  max = Math.floor(max);
-  if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  if (max < min) return NaN;
-  return Math.floor(Math.random() * (max - min + 1)) + min;
-}
+function randomInt(min, max) {}
 
 // simple hash of a number (deterministic), good for mutation
killedBy: numberUtils randomInt range (deterministic check)
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/numberUtils.js:69:7
 function randomInt(min, max) {
   min = Math.ceil(min);
   max = Math.floor(max);
-  if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
+  if (true) return NaN;
   if (max < min) return NaN;
   return Math.floor(Math.random() * (max - min + 1)) + min;
killedBy: numberUtils randomInt range (deterministic check)
statusReason: expected false to be true

[Killed] BooleanLiteral
src/utils/numberUtils.js:69:32
 function randomInt(min, max) {
   min = Math.ceil(min);
   max = Math.floor(max);
-  if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
+  if (!Number.isFinite(min) || Number.isFinite(max)) return NaN;
   if (max < min) return NaN;
   return Math.floor(Math.random() * (max - min + 1)) + min;
killedBy: numberUtils randomInt range (deterministic check)
statusReason: expected false to be true

[Killed] EqualityOperator
src/utils/numberUtils.js:70:7
   min = Math.ceil(min);
   max = Math.floor(max);
   if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  if (max < min) return NaN;
+  if (max >= min) return NaN;
   return Math.floor(Math.random() * (max - min + 1)) + min;
 }
killedBy: numberUtils randomInt range (deterministic check)
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/numberUtils.js:70:7
   min = Math.ceil(min);
   max = Math.floor(max);
   if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  if (max < min) return NaN;
+  if (true) return NaN;
   return Math.floor(Math.random() * (max - min + 1)) + min;
 }
killedBy: numberUtils randomInt range (deterministic check)
statusReason: expected false to be true

[Killed] ArithmeticOperator
src/utils/numberUtils.js:71:10
   max = Math.floor(max);
   if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
   if (max < min) return NaN;
-  return Math.floor(Math.random() * (max - min + 1)) + min;
+  return Math.floor(Math.random() * (max - min + 1)) - min;
 }
 
killedBy: numberUtils randomInt range (deterministic check)
statusReason: expected false to be true

[Survived] ArithmeticOperator
src/utils/numberUtils.js:71:38
   max = Math.floor(max);
   if (!Number.isFinite(min) || !Number.isFinite(max)) return NaN;
   if (max < min) return NaN;
-  return Math.floor(Math.random() * (max - min + 1)) + min;
+  return Math.floor(Math.random() * (max - min - 1)) + min;
 }
 

[Survived] BlockStatement
src/utils/numberUtils.js:75:26
 }
 
 // simple hash of a number (deterministic), good for mutation
-function simpleHash(num) {
-  const n = Number(num);
-  if (!Number.isFinite(n)) return 0;
-  let x = Math.floor(n * 2654435761) >>> 0;
-  x = (x ^ (x >>> 16)) >>> 0;
-  x = (x * 2246822507) >>> 0;
-  return x >>> 0;
-}
+function simpleHash(num) {}
 
 // check if number is approx equal within epsilon

[Survived] BooleanLiteral
src/utils/numberUtils.js:77:7
 // simple hash of a number (deterministic), good for mutation
 function simpleHash(num) {
   const n = Number(num);
-  if (!Number.isFinite(n)) return 0;
+  if (Number.isFinite(n)) return 0;
   let x = Math.floor(n * 2654435761) >>> 0;
   x = (x ^ (x >>> 16)) >>> 0;

[Survived] ConditionalExpression
src/utils/numberUtils.js:77:7
 // simple hash of a number (deterministic), good for mutation
 function simpleHash(num) {
   const n = Number(num);
-  if (!Number.isFinite(n)) return 0;
+  if (false) return 0;
   let x = Math.floor(n * 2654435761) >>> 0;
   x = (x ^ (x >>> 16)) >>> 0;

[Survived] ArithmeticOperator
src/utils/numberUtils.js:78:22
 function simpleHash(num) {
   const n = Number(num);
   if (!Number.isFinite(n)) return 0;
-  let x = Math.floor(n * 2654435761) >>> 0;
+  let x = Math.floor(n / 2654435761) >>> 0;
   x = (x ^ (x >>> 16)) >>> 0;
   x = (x * 2246822507) >>> 0;

[Survived] ArithmeticOperator
src/utils/numberUtils.js:80:8
   if (!Number.isFinite(n)) return 0;
   let x = Math.floor(n * 2654435761) >>> 0;
   x = (x ^ (x >>> 16)) >>> 0;
-  x = (x * 2246822507) >>> 0;
+  x = (x / 2246822507) >>> 0;
   return x >>> 0;
 }

[Killed] BlockStatement
src/utils/numberUtils.js:85:40
 }
 
 // check if number is approx equal within epsilon
-function approxEqual(a, b, eps = 1e-9) {
-  const x = Number(a), y = Number(b);
-  if (!Number.isFinite(x) || !Number.isFinite(y)) return false;
-  return Math.abs(x - y) <= eps;
-}
+function approxEqual(a, b, eps = 1e-9) {}
 
 // normalize number to range [0,1]
killedBy: numberUtils approxEqual works
statusReason: expected undefined to be true

[Killed] BooleanLiteral
src/utils/numberUtils.js:87:30
 // check if number is approx equal within epsilon
 function approxEqual(a, b, eps = 1e-9) {
   const x = Number(a), y = Number(b);
-  if (!Number.isFinite(x) || !Number.isFinite(y)) return false;
+  if (!Number.isFinite(x) || Number.isFinite(y)) return false;
   return Math.abs(x - y) <= eps;
 }
killedBy: numberUtils approxEqual works
statusReason: expected false to be true

[Killed] BooleanLiteral
src/utils/numberUtils.js:87:7
 // check if number is approx equal within epsilon
 function approxEqual(a, b, eps = 1e-9) {
   const x = Number(a), y = Number(b);
-  if (!Number.isFinite(x) || !Number.isFinite(y)) return false;
+  if (Number.isFinite(x) || !Number.isFinite(y)) return false;
   return Math.abs(x - y) <= eps;
 }
killedBy: numberUtils approxEqual works
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/numberUtils.js:88:10
 function approxEqual(a, b, eps = 1e-9) {
   const x = Number(a), y = Number(b);
   if (!Number.isFinite(x) || !Number.isFinite(y)) return false;
-  return Math.abs(x - y) <= eps;
+  return false;
 }
 
killedBy: numberUtils approxEqual works
statusReason: expected false to be true

[Killed] ArithmeticOperator
src/utils/numberUtils.js:88:19
 function approxEqual(a, b, eps = 1e-9) {
   const x = Number(a), y = Number(b);
   if (!Number.isFinite(x) || !Number.isFinite(y)) return false;
-  return Math.abs(x - y) <= eps;
+  return Math.abs(x + y) <= eps;
 }
 
killedBy: numberUtils approxEqual works
statusReason: expected false to be true

[Killed] BlockStatement
src/utils/numberUtils.js:92:35
 }
 
 // normalize number to range [0,1]
-function normalize(num, min, max) {
-  const n = Number(num);
-  if (!Number.isFinite(n) || !Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  if (max === min) return NaN;
-  return (n - min) / (max - min);
-}
+function normalize(num, min, max) {}
 
 // linear interpolate between a and b with t in [0,1]
killedBy: numberUtils normalize and lerp
statusReason: expected undefined to equal 0.5

[Killed] BooleanLiteral
src/utils/numberUtils.js:94:55
 // normalize number to range [0,1]
 function normalize(num, min, max) {
   const n = Number(num);
-  if (!Number.isFinite(n) || !Number.isFinite(min) || !Number.isFinite(max)) return NaN;
+  if (!Number.isFinite(n) || !Number.isFinite(min) || Number.isFinite(max)) return NaN;
   if (max === min) return NaN;
   return (n - min) / (max - min);
killedBy: numberUtils normalize and lerp
statusReason: expected NaN to equal 0.5

[Killed] ConditionalExpression
src/utils/numberUtils.js:94:7
 // normalize number to range [0,1]
 function normalize(num, min, max) {
   const n = Number(num);
-  if (!Number.isFinite(n) || !Number.isFinite(min) || !Number.isFinite(max)) return NaN;
+  if (true) return NaN;
   if (max === min) return NaN;
   return (n - min) / (max - min);
killedBy: numberUtils normalize and lerp
statusReason: expected NaN to equal 0.5

[Killed] EqualityOperator
src/utils/numberUtils.js:95:7
 function normalize(num, min, max) {
   const n = Number(num);
   if (!Number.isFinite(n) || !Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  if (max === min) return NaN;
+  if (max !== min) return NaN;
   return (n - min) / (max - min);
 }
killedBy: numberUtils normalize and lerp
statusReason: expected NaN to equal 0.5

[Killed] ConditionalExpression
src/utils/numberUtils.js:95:7
 function normalize(num, min, max) {
   const n = Number(num);
   if (!Number.isFinite(n) || !Number.isFinite(min) || !Number.isFinite(max)) return NaN;
-  if (max === min) return NaN;
+  if (true) return NaN;
   return (n - min) / (max - min);
 }
killedBy: numberUtils normalize and lerp
statusReason: expected NaN to equal 0.5

[Killed] ArithmeticOperator
src/utils/numberUtils.js:96:10
   const n = Number(num);
   if (!Number.isFinite(n) || !Number.isFinite(min) || !Number.isFinite(max)) return NaN;
   if (max === min) return NaN;
-  return (n - min) / (max - min);
+  return (n - min) * (max - min);
 }
 
killedBy: numberUtils normalize and lerp
statusReason: expected 50 to equal 0.5

[Survived] ArithmeticOperator
src/utils/numberUtils.js:96:11
   const n = Number(num);
   if (!Number.isFinite(n) || !Number.isFinite(min) || !Number.isFinite(max)) return NaN;
   if (max === min) return NaN;
-  return (n - min) / (max - min);
+  return (n + min) / (max - min);
 }
 

[Killed] BlockStatement
src/utils/numberUtils.js:100:24
 }
 
 // linear interpolate between a and b with t in [0,1]
-function lerp(a, b, t) {
-  a = Number(a); b = Number(b); t = Number(t);
-  if (!Number.isFinite(a) || !Number.isFinite(b) || !Number.isFinite(t)) return NaN;
-  return a + (b - a) * t;
-}
+function lerp(a, b, t) {}
 
 // generate arithmetic sequence
killedBy: numberUtils normalize and lerp
statusReason: expected undefined to equal 3

[Killed] ConditionalExpression
src/utils/numberUtils.js:102:7
 // linear interpolate between a and b with t in [0,1]
 function lerp(a, b, t) {
   a = Number(a); b = Number(b); t = Number(t);
-  if (!Number.isFinite(a) || !Number.isFinite(b) || !Number.isFinite(t)) return NaN;
+  if (true) return NaN;
   return a + (b - a) * t;
 }
killedBy: numberUtils normalize and lerp
statusReason: expected NaN to equal 3

[Killed] BooleanLiteral
src/utils/numberUtils.js:102:7
 // linear interpolate between a and b with t in [0,1]
 function lerp(a, b, t) {
   a = Number(a); b = Number(b); t = Number(t);
-  if (!Number.isFinite(a) || !Number.isFinite(b) || !Number.isFinite(t)) return NaN;
+  if (Number.isFinite(a) || !Number.isFinite(b) || !Number.isFinite(t)) return NaN;
   return a + (b - a) * t;
 }
killedBy: numberUtils normalize and lerp
statusReason: expected NaN to equal 3

[Killed] ArithmeticOperator
src/utils/numberUtils.js:103:14
 function lerp(a, b, t) {
   a = Number(a); b = Number(b); t = Number(t);
   if (!Number.isFinite(a) || !Number.isFinite(b) || !Number.isFinite(t)) return NaN;
-  return a + (b - a) * t;
+  return a + (b - a) / t;
 }
 
killedBy: numberUtils normalize and lerp
statusReason: expected 33.333333333333336 to equal 3

[Killed] ArithmeticOperator
src/utils/numberUtils.js:103:10
 function lerp(a, b, t) {
   a = Number(a); b = Number(b); t = Number(t);
   if (!Number.isFinite(a) || !Number.isFinite(b) || !Number.isFinite(t)) return NaN;
-  return a + (b - a) * t;
+  return a - (b - a) * t;
 }
 
killedBy: numberUtils normalize and lerp
statusReason: expected -3 to equal 3

[Killed] BlockStatement
src/utils/numberUtils.js:107:38
 }
 
 // generate arithmetic sequence
-function range(start, end, step = 1) {
-  start = Number(start);
-  end = Number(end);
-  step = Number(step);
-  if (!Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
-  if (step === 0) return [];
-  const out = [];
-  if (step > 0) {
-    for (let x = start; x <= end; x += step) out.push(x);
-  } else {
-    for (let x = start; x >= end; x += step) out.push(x);
-  }
-  return out;
-}
+function range(start, end, step = 1) {}
 
 // moving average
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected undefined to deeply equal [ 1, 3, 5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:111:7
   start = Number(start);
   end = Number(end);
   step = Number(step);
-  if (!Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
+  if (true) return [];
   if (step === 0) return [];
   const out = [];
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 1, 3, 5 ]

[Killed] BooleanLiteral
src/utils/numberUtils.js:111:7
   start = Number(start);
   end = Number(end);
   step = Number(step);
-  if (!Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
+  if (Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
   if (step === 0) return [];
   const out = [];
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 1, 3, 5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:112:7
   end = Number(end);
   step = Number(step);
   if (!Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
-  if (step === 0) return [];
+  if (step !== 0) return [];
   const out = [];
   if (step > 0) {
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 1, 3, 5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:112:7
   end = Number(end);
   step = Number(step);
   if (!Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
-  if (step === 0) return [];
+  if (true) return [];
   const out = [];
   if (step > 0) {
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 1, 3, 5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:114:7
   if (!Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
   if (step === 0) return [];
   const out = [];
-  if (step > 0) {
+  if (true) {
     for (let x = start; x <= end; x += step) out.push(x);
   } else {
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 5, 3, 1 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:114:7
   if (!Number.isFinite(start) || !Number.isFinite(end) || !Number.isFinite(step)) return [];
   if (step === 0) return [];
   const out = [];
-  if (step > 0) {
+  if (false) {
     for (let x = start; x <= end; x += step) out.push(x);
   } else {
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 1, 3, 5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:115:25
   if (step === 0) return [];
   const out = [];
   if (step > 0) {
-    for (let x = start; x <= end; x += step) out.push(x);
+    for (let x = start; false; x += step) out.push(x);
   } else {
     for (let x = start; x >= end; x += step) out.push(x);
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 1, 3, 5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:115:25
   if (step === 0) return [];
   const out = [];
   if (step > 0) {
-    for (let x = start; x <= end; x += step) out.push(x);
+    for (let x = start; x > end; x += step) out.push(x);
   } else {
     for (let x = start; x >= end; x += step) out.push(x);
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 1, 3, 5 ]

[Killed] BlockStatement
src/utils/numberUtils.js:116:10
   const out = [];
   if (step > 0) {
     for (let x = start; x <= end; x += step) out.push(x);
-  } else {
-    for (let x = start; x >= end; x += step) out.push(x);
-  }
+  } else {}
   return out;
 }
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 5, 3, 1 ]
