[Killed] ConditionalExpression
src/utils/numberUtils.js:117:25
   if (step > 0) {
     for (let x = start; x <= end; x += step) out.push(x);
   } else {
-    for (let x = start; x >= end; x += step) out.push(x);
+    for (let x = start; false; x += step) out.push(x);
   }
   return out;
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [] to deeply equal [ 5, 3, 1 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:117:25
   if (step > 0) {
     for (let x = start; x <= end; x += step) out.push(x);
   } else {
-    for (let x = start; x >= end; x += step) out.push(x);
+    for (let x = start; x > end; x += step) out.push(x);
   }
   return out;
killedBy: numberUtils range generates arithmetic sequence
statusReason: expected [ 5, 3 ] to deeply equal [ 5, 3, 1 ]

[Killed] BlockStatement
src/utils/numberUtils.js:123:45
 }
 
 // moving average
-function movingAverage(arr, windowSize = 3) {
-  if (!Array.isArray(arr) || windowSize <= 0) return [];
-  const n = arr.length;
-  const w = Math.floor(windowSize);
-  if (w < 1) return [];
-  const out = [];
-  for (let i = 0; i < n; i++) {
-    let sum = 0, count = 0;
-    for (let j = i - w + 1; j <= i; j++) {
-      if (j >= 0) {
-        const v = Number(arr[j]);
-        if (Number.isFinite(v)) {
-          sum += v;
-          count++;
-        }
-      }
-    }
-    out.push(count > 0 ? sum / count : NaN);
-  }
-  return out;
-}
+function movingAverage(arr, windowSize = 3) {}
 
 // quantize value to nearest step
killedBy: numberUtils movingAverage basic
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/utils/numberUtils.js:124:7
 
 // moving average
 function movingAverage(arr, windowSize = 3) {
-  if (!Array.isArray(arr) || windowSize <= 0) return [];
+  if (true) return [];
   const n = arr.length;
   const w = Math.floor(windowSize);
killedBy: numberUtils movingAverage basic
statusReason: expected [] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:124:30
 
 // moving average
 function movingAverage(arr, windowSize = 3) {
-  if (!Array.isArray(arr) || windowSize <= 0) return [];
+  if (!Array.isArray(arr) || windowSize > 0) return [];
   const n = arr.length;
   const w = Math.floor(windowSize);
killedBy: numberUtils movingAverage basic
statusReason: expected [] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:127:7
   if (!Array.isArray(arr) || windowSize <= 0) return [];
   const n = arr.length;
   const w = Math.floor(windowSize);
-  if (w < 1) return [];
+  if (true) return [];
   const out = [];
   for (let i = 0; i < n; i++) {
killedBy: numberUtils movingAverage basic
statusReason: expected [] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:127:7
   if (!Array.isArray(arr) || windowSize <= 0) return [];
   const n = arr.length;
   const w = Math.floor(windowSize);
-  if (w < 1) return [];
+  if (w >= 1) return [];
   const out = [];
   for (let i = 0; i < n; i++) {
killedBy: numberUtils movingAverage basic
statusReason: expected [] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:129:19
   const w = Math.floor(windowSize);
   if (w < 1) return [];
   const out = [];
-  for (let i = 0; i < n; i++) {
+  for (let i = 0; false; i++) {
     let sum = 0, count = 0;
     for (let j = i - w + 1; j <= i; j++) {
killedBy: numberUtils movingAverage basic
statusReason: expected [] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:129:19
   const w = Math.floor(windowSize);
   if (w < 1) return [];
   const out = [];
-  for (let i = 0; i < n; i++) {
+  for (let i = 0; i <= n; i++) {
     let sum = 0, count = 0;
     for (let j = i - w + 1; j <= i; j++) {
killedBy: numberUtils movingAverage basic
statusReason: expected [ 1, 1.5, 2.5, 3.5, 4 ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] BlockStatement
src/utils/numberUtils.js:131:42
   const out = [];
   for (let i = 0; i < n; i++) {
     let sum = 0, count = 0;
-    for (let j = i - w + 1; j <= i; j++) {
-      if (j >= 0) {
-        const v = Number(arr[j]);
-        if (Number.isFinite(v)) {
-          sum += v;
-          count++;
-        }
-      }
-    }
+    for (let j = i - w + 1; j <= i; j++) {}
     out.push(count > 0 ? sum / count : NaN);
   }
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:131:29
   const out = [];
   for (let i = 0; i < n; i++) {
     let sum = 0, count = 0;
-    for (let j = i - w + 1; j <= i; j++) {
+    for (let j = i - w + 1; j > i; j++) {
       if (j >= 0) {
         const v = Number(arr[j]);
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:132:11
   for (let i = 0; i < n; i++) {
     let sum = 0, count = 0;
     for (let j = i - w + 1; j <= i; j++) {
-      if (j >= 0) {
+      if (false) {
         const v = Number(arr[j]);
         if (Number.isFinite(v)) {
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:132:11
   for (let i = 0; i < n; i++) {
     let sum = 0, count = 0;
     for (let j = i - w + 1; j <= i; j++) {
-      if (j >= 0) {
+      if (j < 0) {
         const v = Number(arr[j]);
         if (Number.isFinite(v)) {
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:134:13
     for (let j = i - w + 1; j <= i; j++) {
       if (j >= 0) {
         const v = Number(arr[j]);
-        if (Number.isFinite(v)) {
+        if (false) {
           sum += v;
           count++;
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] BlockStatement
src/utils/numberUtils.js:134:33
     for (let j = i - w + 1; j <= i; j++) {
       if (j >= 0) {
         const v = Number(arr[j]);
-        if (Number.isFinite(v)) {
-          sum += v;
-          count++;
-        }
+        if (Number.isFinite(v)) {}
       }
     }
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] AssignmentOperator
src/utils/numberUtils.js:135:11
       if (j >= 0) {
         const v = Number(arr[j]);
         if (Number.isFinite(v)) {
-          sum += v;
+          sum -= v;
           count++;
         }
killedBy: numberUtils movingAverage basic
statusReason: expected [ -1, -1.5, -2.5, -3.5 ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] UpdateOperator
src/utils/numberUtils.js:136:11
         const v = Number(arr[j]);
         if (Number.isFinite(v)) {
           sum += v;
-          count++;
+          count--;
         }
       }
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] EqualityOperator
src/utils/numberUtils.js:140:14
         }
       }
     }
-    out.push(count > 0 ? sum / count : NaN);
+    out.push(count <= 0 ? sum / count : NaN);
   }
   return out;
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] ConditionalExpression
src/utils/numberUtils.js:140:14
         }
       }
     }
-    out.push(count > 0 ? sum / count : NaN);
+    out.push(false ? sum / count : NaN);
   }
   return out;
killedBy: numberUtils movingAverage basic
statusReason: expected [ NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1.5, 2.5, 3.5 ]

[Killed] BlockStatement
src/utils/numberUtils.js:146:34
 }
 
 // quantize value to nearest step
-function quantize(num, step = 1) {
-  const n = Number(num); const s = Number(step);
-  if (!Number.isFinite(n) || !Number.isFinite(s) || s <= 0) return NaN;
-  return Math.round(n / s) * s;
-}
+function quantize(num, step = 1) {}
 
 // clamp with wrap-around (for cyclic values like angles)
killedBy: numberUtils quantize works
statusReason: expected undefined to equal 7

[Killed] BooleanLiteral
src/utils/numberUtils.js:148:7
 // quantize value to nearest step
 function quantize(num, step = 1) {
   const n = Number(num); const s = Number(step);
-  if (!Number.isFinite(n) || !Number.isFinite(s) || s <= 0) return NaN;
+  if (Number.isFinite(n) || !Number.isFinite(s) || s <= 0) return NaN;
   return Math.round(n / s) * s;
 }
killedBy: numberUtils quantize works
statusReason: expected NaN to equal 7

[Killed] BooleanLiteral
src/utils/numberUtils.js:148:30
 // quantize value to nearest step
 function quantize(num, step = 1) {
   const n = Number(num); const s = Number(step);
-  if (!Number.isFinite(n) || !Number.isFinite(s) || s <= 0) return NaN;
+  if (!Number.isFinite(n) || Number.isFinite(s) || s <= 0) return NaN;
   return Math.round(n / s) * s;
 }
killedBy: numberUtils quantize works
statusReason: expected NaN to equal 7

[Survived] ArithmeticOperator
src/utils/numberUtils.js:149:21
 function quantize(num, step = 1) {
   const n = Number(num); const s = Number(step);
   if (!Number.isFinite(n) || !Number.isFinite(s) || s <= 0) return NaN;
-  return Math.round(n / s) * s;
+  return Math.round(n * s) * s;
 }
 

[Survived] ArithmeticOperator
src/utils/numberUtils.js:149:10
 function quantize(num, step = 1) {
   const n = Number(num); const s = Number(step);
   if (!Number.isFinite(n) || !Number.isFinite(s) || s <= 0) return NaN;
-  return Math.round(n / s) * s;
+  return Math.round(n / s) / s;
 }
 

[Killed] BlockStatement
src/utils/numberUtils.js:153:30
 }
 
 // clamp with wrap-around (for cyclic values like angles)
-function wrap(num, min, max) {
-  const n = Number(num);
-  if (!Number.isFinite(n)) return NaN;
-  const range = max - min;
-  if (range === 0) return min;
-  return ((((n - min) % range) + range) % range) + min;
-}
+function wrap(num, min, max) {}
 
 module.exports = {
killedBy: numberUtils wrap cyclic behavior
statusReason: expected undefined to equal 10

[Survived] ArithmeticOperator
src/utils/numberUtils.js:156:17
 function wrap(num, min, max) {
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
-  const range = max - min;
+  const range = max + min;
   if (range === 0) return min;
   return ((((n - min) % range) + range) % range) + min;

[Killed] EqualityOperator
src/utils/numberUtils.js:157:7
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const range = max - min;
-  if (range === 0) return min;
+  if (range !== 0) return min;
   return ((((n - min) % range) + range) % range) + min;
 }
killedBy: numberUtils wrap cyclic behavior
statusReason: expected +0 to equal 10

[Killed] ConditionalExpression
src/utils/numberUtils.js:157:7
   const n = Number(num);
   if (!Number.isFinite(n)) return NaN;
   const range = max - min;
-  if (range === 0) return min;
+  if (true) return min;
   return ((((n - min) % range) + range) % range) + min;
 }
killedBy: numberUtils wrap cyclic behavior
statusReason: expected +0 to equal 10

[Killed] ArithmeticOperator
src/utils/numberUtils.js:158:11
   if (!Number.isFinite(n)) return NaN;
   const range = max - min;
   if (range === 0) return min;
-  return ((((n - min) % range) + range) % range) + min;
+  return (((n - min) % range + range) * range) + min;
 }
 
killedBy: numberUtils wrap cyclic behavior
statusReason: expected 133200 to equal 10

[Killed] ArithmeticOperator
src/utils/numberUtils.js:158:13
   if (!Number.isFinite(n)) return NaN;
   const range = max - min;
   if (range === 0) return min;
-  return ((((n - min) % range) + range) % range) + min;
+  return ((((n - min) * range) + range) % range) + min;
 }
 
killedBy: numberUtils wrap cyclic behavior
statusReason: expected +0 to equal 10

[Killed] ObjectLiteral
src/utils/numberUtils.js:161:18
   return ((((n - min) % range) + range) % range) + min;
 }
 
-module.exports = {
-  clamp,
-  roundTo,
-  floorTo,
-  ceilTo,
-  safeParseFloat,
-  safeParseInt,
-  degToRad,
-  radToDeg,
-  randomFloat,
-  randomInt,
-  simpleHash,
-  approxEqual,
-  normalize,
-  lerp,
-  range,
-  movingAverage,
-  quantize,
-  wrap
-};
+module.exports = {};
 
killedBy: numberUtils clamp works
statusReason: num.clamp is not a function
