[Killed] BlockStatement
src/utils/searchUtils.js:2:46
 // src/utils/searchUtils.js
-function binarySearch(sortedArr, comparator) {
-  if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
-  let lo = 0, hi = sortedArr.length - 1;
-  while (lo <= hi) {
-    const mid = Math.floor((lo + hi) / 2);
-    const cmp = comparator(sortedArr[mid], mid);
-    if (cmp === 0) return mid;
-    if (cmp < 0) hi = mid - 1;
-    else lo = mid + 1;
-  }
-  return -lo - 1;
-}
+function binarySearch(sortedArr, comparator) {}
 
 function binarySearchByKey(sortedArr, key, target) {
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected undefined to equal 1

[Killed] ConditionalExpression
src/utils/searchUtils.js:3:7
 // src/utils/searchUtils.js
 function binarySearch(sortedArr, comparator) {
-  if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
+  if (true) throw new Error('bad args');
   let lo = 0, hi = sortedArr.length - 1;
   while (lo <= hi) {
killedBy: searchUtils binarySearchByKey finds index
statusReason: bad args

[Killed] BooleanLiteral
src/utils/searchUtils.js:3:7
 // src/utils/searchUtils.js
 function binarySearch(sortedArr, comparator) {
-  if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
+  if (Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
   let lo = 0, hi = sortedArr.length - 1;
   while (lo <= hi) {
killedBy: searchUtils binarySearchByKey finds index
statusReason: bad args

[Survived] ArithmeticOperator
src/utils/searchUtils.js:4:20
 // src/utils/searchUtils.js
 function binarySearch(sortedArr, comparator) {
   if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
-  let lo = 0, hi = sortedArr.length - 1;
+  let lo = 0, hi = sortedArr.length + 1;
   while (lo <= hi) {
     const mid = Math.floor((lo + hi) / 2);

[Killed] EqualityOperator
src/utils/searchUtils.js:5:10
 function binarySearch(sortedArr, comparator) {
   if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
   let lo = 0, hi = sortedArr.length - 1;
-  while (lo <= hi) {
+  while (lo > hi) {
     const mid = Math.floor((lo + hi) / 2);
     const cmp = comparator(sortedArr[mid], mid);
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected -1 to equal 1

[Killed] ConditionalExpression
src/utils/searchUtils.js:5:10
 function binarySearch(sortedArr, comparator) {
   if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
   let lo = 0, hi = sortedArr.length - 1;
-  while (lo <= hi) {
+  while (false) {
     const mid = Math.floor((lo + hi) / 2);
     const cmp = comparator(sortedArr[mid], mid);
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected -1 to equal 1

[Killed] ArithmeticOperator
src/utils/searchUtils.js:6:28
   if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
   let lo = 0, hi = sortedArr.length - 1;
   while (lo <= hi) {
-    const mid = Math.floor((lo + hi) / 2);
+    const mid = Math.floor((lo + hi) * 2);
     const cmp = comparator(sortedArr[mid], mid);
     if (cmp === 0) return mid;
killedBy: searchUtils binarySearchByKey finds index
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArithmeticOperator
src/utils/searchUtils.js:6:29
   if (!Array.isArray(sortedArr) || typeof comparator !== 'function') throw new Error('bad args');
   let lo = 0, hi = sortedArr.length - 1;
   while (lo <= hi) {
-    const mid = Math.floor((lo + hi) / 2);
+    const mid = Math.floor((lo - hi) / 2);
     const cmp = comparator(sortedArr[mid], mid);
     if (cmp === 0) return mid;
killedBy: searchUtils binarySearchByKey finds index
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/utils/searchUtils.js:8:9
   while (lo <= hi) {
     const mid = Math.floor((lo + hi) / 2);
     const cmp = comparator(sortedArr[mid], mid);
-    if (cmp === 0) return mid;
+    if (false) return mid;
     if (cmp < 0) hi = mid - 1;
     else lo = mid + 1;
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected -3 to equal 1

[Killed] EqualityOperator
src/utils/searchUtils.js:8:9
   while (lo <= hi) {
     const mid = Math.floor((lo + hi) / 2);
     const cmp = comparator(sortedArr[mid], mid);
-    if (cmp === 0) return mid;
+    if (cmp !== 0) return mid;
     if (cmp < 0) hi = mid - 1;
     else lo = mid + 1;
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected 2 to equal 1

[NoCoverage] EqualityOperator
src/utils/searchUtils.js:9:9
     const mid = Math.floor((lo + hi) / 2);
     const cmp = comparator(sortedArr[mid], mid);
     if (cmp === 0) return mid;
-    if (cmp < 0) hi = mid - 1;
+    if (cmp >= 0) hi = mid - 1;
     else lo = mid + 1;
   }

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:9:9
     const mid = Math.floor((lo + hi) / 2);
     const cmp = comparator(sortedArr[mid], mid);
     if (cmp === 0) return mid;
-    if (cmp < 0) hi = mid - 1;
+    if (true) hi = mid - 1;
     else lo = mid + 1;
   }

[NoCoverage] ArithmeticOperator
src/utils/searchUtils.js:10:15
     const cmp = comparator(sortedArr[mid], mid);
     if (cmp === 0) return mid;
     if (cmp < 0) hi = mid - 1;
-    else lo = mid + 1;
+    else lo = mid - 1;
   }
   return -lo - 1;

[NoCoverage] UnaryOperator
src/utils/searchUtils.js:12:10
     if (cmp < 0) hi = mid - 1;
     else lo = mid + 1;
   }
-  return -lo - 1;
+  return +lo - 1;
 }
 

[NoCoverage] ArithmeticOperator
src/utils/searchUtils.js:12:10
     if (cmp < 0) hi = mid - 1;
     else lo = mid + 1;
   }
-  return -lo - 1;
+  return -lo + 1;
 }
 

[Killed] BlockStatement
src/utils/searchUtils.js:15:52
   return -lo - 1;
 }
 
-function binarySearchByKey(sortedArr, key, target) {
-  return binarySearch(sortedArr, (v) => {
-    if (v[key] === target) return 0;
-    return v[key] > target ? -1 : 1;
-  });
-}
+function binarySearchByKey(sortedArr, key, target) {}
 
 function wildcardMatch(pattern, text) {
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected undefined to equal 1

[Killed] BlockStatement
src/utils/searchUtils.js:16:41
 }
 
 function binarySearchByKey(sortedArr, key, target) {
-  return binarySearch(sortedArr, (v) => {
-    if (v[key] === target) return 0;
-    return v[key] > target ? -1 : 1;
-  });
+  return binarySearch(sortedArr, (v) => {});
 }
 
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected -4 to equal 1

[Killed] EqualityOperator
src/utils/searchUtils.js:17:9
 
 function binarySearchByKey(sortedArr, key, target) {
   return binarySearch(sortedArr, (v) => {
-    if (v[key] === target) return 0;
+    if (v[key] !== target) return 0;
     return v[key] > target ? -1 : 1;
   });
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected 2 to equal 1

[Killed] ConditionalExpression
src/utils/searchUtils.js:17:9
 
 function binarySearchByKey(sortedArr, key, target) {
   return binarySearch(sortedArr, (v) => {
-    if (v[key] === target) return 0;
+    if (false) return 0;
     return v[key] > target ? -1 : 1;
   });
killedBy: searchUtils binarySearchByKey finds index
statusReason: expected -3 to equal 1

[NoCoverage] UnaryOperator
src/utils/searchUtils.js:18:30
 function binarySearchByKey(sortedArr, key, target) {
   return binarySearch(sortedArr, (v) => {
     if (v[key] === target) return 0;
-    return v[key] > target ? -1 : 1;
+    return v[key] > target ? +1 : 1;
   });
 }

[NoCoverage] EqualityOperator
src/utils/searchUtils.js:18:12
 function binarySearchByKey(sortedArr, key, target) {
   return binarySearch(sortedArr, (v) => {
     if (v[key] === target) return 0;
-    return v[key] > target ? -1 : 1;
+    return v[key] >= target ? -1 : 1;
   });
 }

[Killed] BlockStatement
src/utils/searchUtils.js:22:39
   });
 }
 
-function wildcardMatch(pattern, text) {
-  if (typeof pattern !== 'string' || typeof text !== 'string') return false;
-
-  // Escape special regex chars EXCEPT * and ?
-  const escaped = pattern.replace(/([.+^${}()|[\]\\])/g, '\\$1');
-
-  // Convert wildcard chars
-  const regexStr = '^' +
-    escaped
-      .replace(/\*/g, '.*')
-      .replace(/\?/g, '.') +
-    '$';
-
-  return new RegExp(regexStr, 'i').test(text);
-}
+function wildcardMatch(pattern, text) {}
 
 
killedBy: searchUtils wildcardMatch works
statusReason: expected undefined to be true

[Killed] EqualityOperator
src/utils/searchUtils.js:23:38
 }
 
 function wildcardMatch(pattern, text) {
-  if (typeof pattern !== 'string' || typeof text !== 'string') return false;
+  if (typeof pattern !== 'string' || typeof text === 'string') return false;
 
   // Escape special regex chars EXCEPT * and ?
killedBy: searchUtils wildcardMatch works
statusReason: expected false to be true

[Killed] EqualityOperator
src/utils/searchUtils.js:23:7
 }
 
 function wildcardMatch(pattern, text) {
-  if (typeof pattern !== 'string' || typeof text !== 'string') return false;
+  if (typeof pattern === 'string' || typeof text !== 'string') return false;
 
   // Escape special regex chars EXCEPT * and ?
killedBy: searchUtils wildcardMatch works
statusReason: expected false to be true

[Survived] StringLiteral
src/utils/searchUtils.js:29:20
   const escaped = pattern.replace(/([.+^${}()|[\]\\])/g, '\\$1');
 
   // Convert wildcard chars
-  const regexStr = '^' +
+  const regexStr = "" +
     escaped
       .replace(/\*/g, '.*')

[Killed] StringLiteral
src/utils/searchUtils.js:31:23
   // Convert wildcard chars
   const regexStr = '^' +
     escaped
-      .replace(/\*/g, '.*')
+      .replace(/\*/g, "")
       .replace(/\?/g, '.') +
     '$';
killedBy: searchUtils wildcardMatch works
statusReason: expected false to be true

[Killed] BlockStatement
src/utils/searchUtils.js:39:37
 }
 
 
-function fuzzyContains(text, query) {
-  if (!query) return true;
-  if (!text) return false;
-  const s = String(text).toLowerCase();
-  const q = String(query).toLowerCase();
-  let i = 0, j = 0;
-  while (i < s.length && j < q.length) {
-    if (s[i] === q[j]) j++;
-    i++;
-  }
-  return j === q.length;
-}
+function fuzzyContains(text, query) {}
 
 function multiFieldFilter(arr, fields, pattern) {
killedBy: searchUtils fuzzyContains basic
statusReason: expected undefined to be true

[Killed] ConditionalExpression
src/utils/searchUtils.js:40:7
 
 
 function fuzzyContains(text, query) {
-  if (!query) return true;
+  if (true) return true;
   if (!text) return false;
   const s = String(text).toLowerCase();
killedBy: searchUtils fuzzyContains basic
statusReason: expected true to be false

[Killed] BooleanLiteral
src/utils/searchUtils.js:40:7
 
 
 function fuzzyContains(text, query) {
-  if (!query) return true;
+  if (query) return true;
   if (!text) return false;
   const s = String(text).toLowerCase();
killedBy: searchUtils fuzzyContains basic
statusReason: expected true to be false

[Killed] BooleanLiteral
src/utils/searchUtils.js:41:7
 
 function fuzzyContains(text, query) {
   if (!query) return true;
-  if (!text) return false;
+  if (text) return false;
   const s = String(text).toLowerCase();
   const q = String(query).toLowerCase();
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/searchUtils.js:41:7
 
 function fuzzyContains(text, query) {
   if (!query) return true;
-  if (!text) return false;
+  if (true) return false;
   const s = String(text).toLowerCase();
   const q = String(query).toLowerCase();
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] MethodExpression
src/utils/searchUtils.js:42:13
 function fuzzyContains(text, query) {
   if (!query) return true;
   if (!text) return false;
-  const s = String(text).toLowerCase();
+  const s = String(text).toUpperCase();
   const q = String(query).toLowerCase();
   let i = 0, j = 0;
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] MethodExpression
src/utils/searchUtils.js:43:13
   if (!query) return true;
   if (!text) return false;
   const s = String(text).toLowerCase();
-  const q = String(query).toLowerCase();
+  const q = String(query).toUpperCase();
   let i = 0, j = 0;
   while (i < s.length && j < q.length) {
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/searchUtils.js:45:10
   const s = String(text).toLowerCase();
   const q = String(query).toLowerCase();
   let i = 0, j = 0;
-  while (i < s.length && j < q.length) {
+  while (false) {
     if (s[i] === q[j]) j++;
     i++;
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] EqualityOperator
src/utils/searchUtils.js:45:26
   const s = String(text).toLowerCase();
   const q = String(query).toLowerCase();
   let i = 0, j = 0;
-  while (i < s.length && j < q.length) {
+  while (i < s.length && j >= q.length) {
     if (s[i] === q[j]) j++;
     i++;
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] ConditionalExpression
src/utils/searchUtils.js:46:9
   const q = String(query).toLowerCase();
   let i = 0, j = 0;
   while (i < s.length && j < q.length) {
-    if (s[i] === q[j]) j++;
+    if (false) j++;
     i++;
   }
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] UpdateOperator
src/utils/searchUtils.js:46:24
   const q = String(query).toLowerCase();
   let i = 0, j = 0;
   while (i < s.length && j < q.length) {
-    if (s[i] === q[j]) j++;
+    if (s[i] === q[j]) j--;
     i++;
   }
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Timeout] UpdateOperator
src/utils/searchUtils.js:47:5
   let i = 0, j = 0;
   while (i < s.length && j < q.length) {
     if (s[i] === q[j]) j++;
-    i++;
+    i--;
   }
   return j === q.length;

[Killed] ConditionalExpression
src/utils/searchUtils.js:49:10
     if (s[i] === q[j]) j++;
     i++;
   }
-  return j === q.length;
+  return false;
 }
 
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[Killed] EqualityOperator
src/utils/searchUtils.js:49:10
     if (s[i] === q[j]) j++;
     i++;
   }
-  return j === q.length;
+  return j !== q.length;
 }
 
killedBy: searchUtils fuzzyContains basic
statusReason: expected false to be true

[NoCoverage] BlockStatement
src/utils/searchUtils.js:52:49
   return j === q.length;
 }
 
-function multiFieldFilter(arr, fields, pattern) {
-  if (!Array.isArray(arr)) return [];
-  const pat = (pattern || '').trim();
-  if (!pat) return arr.slice();
-  return arr.filter(item => {
-    return fields.some(f => {
-      const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
-      return wildcardMatch(pat, v) || fuzzyContains(v, pat);
-    });
-  });
-}
+function multiFieldFilter(arr, fields, pattern) {}
 
 function partition(arr, predicate) {

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:53:7
 }
 
 function multiFieldFilter(arr, fields, pattern) {
-  if (!Array.isArray(arr)) return [];
+  if (false) return [];
   const pat = (pattern || '').trim();
   if (!pat) return arr.slice();

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:53:7
 }
 
 function multiFieldFilter(arr, fields, pattern) {
-  if (!Array.isArray(arr)) return [];
+  if (true) return [];
   const pat = (pattern || '').trim();
   if (!pat) return arr.slice();

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:54:16
 
 function multiFieldFilter(arr, fields, pattern) {
   if (!Array.isArray(arr)) return [];
-  const pat = (pattern || '').trim();
+  const pat = (false).trim();
   if (!pat) return arr.slice();
   return arr.filter(item => {

[NoCoverage] MethodExpression
src/utils/searchUtils.js:54:15
 
 function multiFieldFilter(arr, fields, pattern) {
   if (!Array.isArray(arr)) return [];
-  const pat = (pattern || '').trim();
+  const pat = pattern || '';
   if (!pat) return arr.slice();
   return arr.filter(item => {

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:55:7
 function multiFieldFilter(arr, fields, pattern) {
   if (!Array.isArray(arr)) return [];
   const pat = (pattern || '').trim();
-  if (!pat) return arr.slice();
+  if (false) return arr.slice();
   return arr.filter(item => {
     return fields.some(f => {

[NoCoverage] MethodExpression
src/utils/searchUtils.js:55:20
 function multiFieldFilter(arr, fields, pattern) {
   if (!Array.isArray(arr)) return [];
   const pat = (pattern || '').trim();
-  if (!pat) return arr.slice();
+  if (!pat) return arr;
   return arr.filter(item => {
     return fields.some(f => {

[NoCoverage] MethodExpression
src/utils/searchUtils.js:56:10
   if (!Array.isArray(arr)) return [];
   const pat = (pattern || '').trim();
   if (!pat) return arr.slice();
-  return arr.filter(item => {
-    return fields.some(f => {
-      const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
-      return wildcardMatch(pat, v) || fuzzyContains(v, pat);
-    });
-  });
+  return arr;
 }
 

[NoCoverage] BlockStatement
src/utils/searchUtils.js:56:29
   if (!Array.isArray(arr)) return [];
   const pat = (pattern || '').trim();
   if (!pat) return arr.slice();
-  return arr.filter(item => {
-    return fields.some(f => {
-      const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
-      return wildcardMatch(pat, v) || fuzzyContains(v, pat);
-    });
-  });
+  return arr.filter(item => {});
 }
 

[NoCoverage] BlockStatement
src/utils/searchUtils.js:57:29
   const pat = (pattern || '').trim();
   if (!pat) return arr.slice();
   return arr.filter(item => {
-    return fields.some(f => {
-      const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
-      return wildcardMatch(pat, v) || fuzzyContains(v, pat);
-    });
+    return fields.some(f => {});
   });
 }

[NoCoverage] MethodExpression
src/utils/searchUtils.js:57:12
   const pat = (pattern || '').trim();
   if (!pat) return arr.slice();
   return arr.filter(item => {
-    return fields.some(f => {
-      const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
-      return wildcardMatch(pat, v) || fuzzyContains(v, pat);
-    });
+    return fields.every(f => {
+  const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
+  return wildcardMatch(pat, v) || fuzzyContains(v, pat);
+});
   });
 }

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:58:73
   if (!pat) return arr.slice();
   return arr.filter(item => {
     return fields.some(f => {
-      const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
+      const v = item && (typeof item[f] === 'string' ? item[f] : String(true));
       return wildcardMatch(pat, v) || fuzzyContains(v, pat);
     });

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:58:17
   if (!pat) return arr.slice();
   return arr.filter(item => {
     return fields.some(f => {
-      const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
+      const v = false;
       return wildcardMatch(pat, v) || fuzzyContains(v, pat);
     });

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:59:14
   return arr.filter(item => {
     return fields.some(f => {
       const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
-      return wildcardMatch(pat, v) || fuzzyContains(v, pat);
+      return false;
     });
   });

[NoCoverage] LogicalOperator
src/utils/searchUtils.js:59:14
   return arr.filter(item => {
     return fields.some(f => {
       const v = item && (typeof item[f] === 'string' ? item[f] : String(item[f] || ''));
-      return wildcardMatch(pat, v) || fuzzyContains(v, pat);
+      return wildcardMatch(pat, v) && fuzzyContains(v, pat);
     });
   });

[NoCoverage] BlockStatement
src/utils/searchUtils.js:64:36
   });
 }
 
-function partition(arr, predicate) {
-  const left = [], right = [];
-  for (let i = 0; i < arr.length; i++) {
-    (predicate(arr[i], i) ? left : right).push(arr[i]);
-  }
-  return [left, right];
-}
+function partition(arr, predicate) {}
 
 module.exports = {

[NoCoverage] ArrayDeclaration
src/utils/searchUtils.js:65:28
 }
 
 function partition(arr, predicate) {
-  const left = [], right = [];
+  const left = [], right = ["Stryker was here"];
   for (let i = 0; i < arr.length; i++) {
     (predicate(arr[i], i) ? left : right).push(arr[i]);

[NoCoverage] ArrayDeclaration
src/utils/searchUtils.js:65:16
 }
 
 function partition(arr, predicate) {
-  const left = [], right = [];
+  const left = ["Stryker was here"], right = [];
   for (let i = 0; i < arr.length; i++) {
     (predicate(arr[i], i) ? left : right).push(arr[i]);

[NoCoverage] EqualityOperator
src/utils/searchUtils.js:66:19
 
 function partition(arr, predicate) {
   const left = [], right = [];
-  for (let i = 0; i < arr.length; i++) {
+  for (let i = 0; i >= arr.length; i++) {
     (predicate(arr[i], i) ? left : right).push(arr[i]);
   }

[NoCoverage] ConditionalExpression
src/utils/searchUtils.js:66:19
 
 function partition(arr, predicate) {
   const left = [], right = [];
-  for (let i = 0; i < arr.length; i++) {
+  for (let i = 0; false; i++) {
     (predicate(arr[i], i) ? left : right).push(arr[i]);
   }

[NoCoverage] ArrayDeclaration
src/utils/searchUtils.js:69:10
   for (let i = 0; i < arr.length; i++) {
     (predicate(arr[i], i) ? left : right).push(arr[i]);
   }
-  return [left, right];
+  return [];
 }
 
