[Killed] BlockStatement
src/utils/statsUtils.js:2:34
 // src/utils/statsUtils.js
-function ensureNumericArray(arr) {
-  if (!Array.isArray(arr)) throw new Error('expected array');
-  return arr.map(x => {
-    const n = Number(x);
-    if (!Number.isFinite(n)) throw new Error('non-numeric value encountered');
-    return n;
-  });
-}
+function ensureNumericArray(arr) {}
 
 function mean(arr) {
killedBy: statsUtils mean & median
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/utils/statsUtils.js:3:7
 // src/utils/statsUtils.js
 function ensureNumericArray(arr) {
-  if (!Array.isArray(arr)) throw new Error('expected array');
+  if (Array.isArray(arr)) throw new Error('expected array');
   return arr.map(x => {
     const n = Number(x);
killedBy: statsUtils mean & median
statusReason: expected array

[Killed] ConditionalExpression
src/utils/statsUtils.js:3:7
 // src/utils/statsUtils.js
 function ensureNumericArray(arr) {
-  if (!Array.isArray(arr)) throw new Error('expected array');
+  if (true) throw new Error('expected array');
   return arr.map(x => {
     const n = Number(x);
killedBy: statsUtils mean & median
statusReason: expected array

[Killed] BlockStatement
src/utils/statsUtils.js:4:23
 // src/utils/statsUtils.js
 function ensureNumericArray(arr) {
   if (!Array.isArray(arr)) throw new Error('expected array');
-  return arr.map(x => {
-    const n = Number(x);
-    if (!Number.isFinite(n)) throw new Error('non-numeric value encountered');
-    return n;
-  });
+  return arr.map(x => {});
 }
 
killedBy: statsUtils mean & median
statusReason: expected NaN to equal 2

[Killed] ConditionalExpression
src/utils/statsUtils.js:6:9
   if (!Array.isArray(arr)) throw new Error('expected array');
   return arr.map(x => {
     const n = Number(x);
-    if (!Number.isFinite(n)) throw new Error('non-numeric value encountered');
+    if (true) throw new Error('non-numeric value encountered');
     return n;
   });
killedBy: statsUtils mean & median
statusReason: non-numeric value encountered

[Killed] BooleanLiteral
src/utils/statsUtils.js:6:9
   if (!Array.isArray(arr)) throw new Error('expected array');
   return arr.map(x => {
     const n = Number(x);
-    if (!Number.isFinite(n)) throw new Error('non-numeric value encountered');
+    if (Number.isFinite(n)) throw new Error('non-numeric value encountered');
     return n;
   });
killedBy: statsUtils mean & median
statusReason: non-numeric value encountered

[Killed] BlockStatement
src/utils/statsUtils.js:11:20
   });
 }
 
-function mean(arr) {
-  const a = ensureNumericArray(arr);
-  if (a.length === 0) return NaN;
-  let s = 0;
-  for (let i = 0; i < a.length; i++) s += a[i];
-  return s / a.length;
-}
+function mean(arr) {}
 
 function median(arr) {
killedBy: statsUtils mean & median
statusReason: expected undefined to equal 2

[Killed] ConditionalExpression
src/utils/statsUtils.js:13:7
 
 function mean(arr) {
   const a = ensureNumericArray(arr);
-  if (a.length === 0) return NaN;
+  if (true) return NaN;
   let s = 0;
   for (let i = 0; i < a.length; i++) s += a[i];
killedBy: statsUtils mean & median
statusReason: expected NaN to equal 2

[Killed] EqualityOperator
src/utils/statsUtils.js:13:7
 
 function mean(arr) {
   const a = ensureNumericArray(arr);
-  if (a.length === 0) return NaN;
+  if (a.length !== 0) return NaN;
   let s = 0;
   for (let i = 0; i < a.length; i++) s += a[i];
killedBy: statsUtils mean & median
statusReason: expected NaN to equal 2

[Killed] EqualityOperator
src/utils/statsUtils.js:15:19
   const a = ensureNumericArray(arr);
   if (a.length === 0) return NaN;
   let s = 0;
-  for (let i = 0; i < a.length; i++) s += a[i];
+  for (let i = 0; i <= a.length; i++) s += a[i];
   return s / a.length;
 }
killedBy: statsUtils mean & median
statusReason: expected NaN to equal 2

[Killed] AssignmentOperator
src/utils/statsUtils.js:15:38
   const a = ensureNumericArray(arr);
   if (a.length === 0) return NaN;
   let s = 0;
-  for (let i = 0; i < a.length; i++) s += a[i];
+  for (let i = 0; i < a.length; i++) s -= a[i];
   return s / a.length;
 }
killedBy: statsUtils mean & median
statusReason: expected -2 to equal 2

[Killed] ArithmeticOperator
src/utils/statsUtils.js:16:10
   if (a.length === 0) return NaN;
   let s = 0;
   for (let i = 0; i < a.length; i++) s += a[i];
-  return s / a.length;
+  return s * a.length;
 }
 
killedBy: statsUtils mean & median
statusReason: expected 18 to equal 2

[Killed] BlockStatement
src/utils/statsUtils.js:19:22
   return s / a.length;
 }
 
-function median(arr) {
-  const a = ensureNumericArray(arr).slice().sort((x,y)=>x-y);
-  const n = a.length;
-  if (n === 0) return NaN;
-  if (n % 2 === 1) return a[(n-1)/2];
-  return (a[n/2 - 1] + a[n/2]) / 2;
-}
+function median(arr) {}
 
 function variance(arr, sample = true) {
killedBy: statsUtils mean & median
statusReason: expected undefined to equal 3

[Killed] ArithmeticOperator
src/utils/statsUtils.js:20:57
 }
 
 function median(arr) {
-  const a = ensureNumericArray(arr).slice().sort((x,y)=>x-y);
+  const a = ensureNumericArray(arr).slice().sort((x,y)=>x + y);
   const n = a.length;
   if (n === 0) return NaN;
killedBy: statsUtils mean & median
statusReason: expected 1 to equal 3

[Killed] ArrowFunction
src/utils/statsUtils.js:20:50
 }
 
 function median(arr) {
-  const a = ensureNumericArray(arr).slice().sort((x,y)=>x-y);
+  const a = ensureNumericArray(arr).slice().sort(() => undefined);
   const n = a.length;
   if (n === 0) return NaN;
killedBy: statsUtils mean & median
statusReason: expected 1 to equal 3

[Killed] EqualityOperator
src/utils/statsUtils.js:22:7
 function median(arr) {
   const a = ensureNumericArray(arr).slice().sort((x,y)=>x-y);
   const n = a.length;
-  if (n === 0) return NaN;
+  if (n !== 0) return NaN;
   if (n % 2 === 1) return a[(n-1)/2];
   return (a[n/2 - 1] + a[n/2]) / 2;
killedBy: statsUtils mean & median
statusReason: expected NaN to equal 3

[Killed] ConditionalExpression
src/utils/statsUtils.js:22:7
 function median(arr) {
   const a = ensureNumericArray(arr).slice().sort((x,y)=>x-y);
   const n = a.length;
-  if (n === 0) return NaN;
+  if (true) return NaN;
   if (n % 2 === 1) return a[(n-1)/2];
   return (a[n/2 - 1] + a[n/2]) / 2;
killedBy: statsUtils mean & median
statusReason: expected NaN to equal 3

[Killed] ArithmeticOperator
src/utils/statsUtils.js:23:7
   const a = ensureNumericArray(arr).slice().sort((x,y)=>x-y);
   const n = a.length;
   if (n === 0) return NaN;
-  if (n % 2 === 1) return a[(n-1)/2];
+  if (n * 2 === 1) return a[(n-1)/2];
   return (a[n/2 - 1] + a[n/2]) / 2;
 }
killedBy: statsUtils mean & median
statusReason: expected NaN to equal 3

[Killed] ArithmeticOperator
src/utils/statsUtils.js:23:29
   const a = ensureNumericArray(arr).slice().sort((x,y)=>x-y);
   const n = a.length;
   if (n === 0) return NaN;
-  if (n % 2 === 1) return a[(n-1)/2];
+  if (n % 2 === 1) return a[(n - 1) * 2];
   return (a[n/2 - 1] + a[n/2]) / 2;
 }
killedBy: statsUtils mean & median
statusReason: expected undefined to equal 3

[NoCoverage] ArithmeticOperator
src/utils/statsUtils.js:24:26
   const n = a.length;
   if (n === 0) return NaN;
   if (n % 2 === 1) return a[(n-1)/2];
-  return (a[n/2 - 1] + a[n/2]) / 2;
+  return (a[n/2 - 1] + a[n * 2]) / 2;
 }
 

[NoCoverage] ArithmeticOperator
src/utils/statsUtils.js:24:10
   const n = a.length;
   if (n === 0) return NaN;
   if (n % 2 === 1) return a[(n-1)/2];
-  return (a[n/2 - 1] + a[n/2]) / 2;
+  return (a[n / 2 - 1] + a[n / 2]) * 2;
 }
 

[NoCoverage] BlockStatement
src/utils/statsUtils.js:27:39
   return (a[n/2 - 1] + a[n/2]) / 2;
 }
 
-function variance(arr, sample = true) {
-  const a = ensureNumericArray(arr);
-  const n = a.length;
-  if (n === 0) return NaN;
-  const mu = mean(a);
-  let ss = 0;
-  for (let i = 0; i < n; i++) {
-    const d = a[i] - mu;
-    ss += d * d;
-  }
-  return sample ? ss / (n - (n>1?1:0)) : ss / n;
-}
+function variance(arr, sample = true) {}
 
 function stddev(arr, sample = true) {

[NoCoverage] BooleanLiteral
src/utils/statsUtils.js:27:33
   return (a[n/2 - 1] + a[n/2]) / 2;
 }
 
-function variance(arr, sample = true) {
+function variance(arr, sample = false) {
   const a = ensureNumericArray(arr);
   const n = a.length;

[NoCoverage] ConditionalExpression
src/utils/statsUtils.js:30:7
 function variance(arr, sample = true) {
   const a = ensureNumericArray(arr);
   const n = a.length;
-  if (n === 0) return NaN;
+  if (false) return NaN;
   const mu = mean(a);
   let ss = 0;

[NoCoverage] EqualityOperator
src/utils/statsUtils.js:33:19
   if (n === 0) return NaN;
   const mu = mean(a);
   let ss = 0;
-  for (let i = 0; i < n; i++) {
+  for (let i = 0; i >= n; i++) {
     const d = a[i] - mu;
     ss += d * d;

[NoCoverage] BlockStatement
src/utils/statsUtils.js:33:31
   if (n === 0) return NaN;
   const mu = mean(a);
   let ss = 0;
-  for (let i = 0; i < n; i++) {
-    const d = a[i] - mu;
-    ss += d * d;
-  }
+  for (let i = 0; i < n; i++) {}
   return sample ? ss / (n - (n>1?1:0)) : ss / n;
 }

[NoCoverage] ArithmeticOperator
src/utils/statsUtils.js:34:15
   const mu = mean(a);
   let ss = 0;
   for (let i = 0; i < n; i++) {
-    const d = a[i] - mu;
+    const d = a[i] + mu;
     ss += d * d;
   }

[NoCoverage] AssignmentOperator
src/utils/statsUtils.js:35:5
   let ss = 0;
   for (let i = 0; i < n; i++) {
     const d = a[i] - mu;
-    ss += d * d;
+    ss -= d * d;
   }
   return sample ? ss / (n - (n>1?1:0)) : ss / n;

[NoCoverage] ArithmeticOperator
src/utils/statsUtils.js:35:11
   let ss = 0;
   for (let i = 0; i < n; i++) {
     const d = a[i] - mu;
-    ss += d * d;
+    ss += d / d;
   }
   return sample ? ss / (n - (n>1?1:0)) : ss / n;

[NoCoverage] ArithmeticOperator
src/utils/statsUtils.js:37:42
     const d = a[i] - mu;
     ss += d * d;
   }
-  return sample ? ss / (n - (n>1?1:0)) : ss / n;
+  return sample ? ss / (n - (n>1?1:0)) : ss * n;
 }
 

[NoCoverage] ArithmeticOperator
src/utils/statsUtils.js:37:25
     const d = a[i] - mu;
     ss += d * d;
   }
-  return sample ? ss / (n - (n>1?1:0)) : ss / n;
+  return sample ? ss / (n + (n > 1 ? 1 : 0)) : ss / n;
 }
 

[NoCoverage] BlockStatement
src/utils/statsUtils.js:40:37
   return sample ? ss / (n - (n>1?1:0)) : ss / n;
 }
 
-function stddev(arr, sample = true) {
-  const v = variance(arr, sample);
-  return Math.sqrt(v);
-}
+function stddev(arr, sample = true) {}
 
 function pearsonCorrelation(xArr, yArr) {

[NoCoverage] BooleanLiteral
src/utils/statsUtils.js:40:31
   return sample ? ss / (n - (n>1?1:0)) : ss / n;
 }
 
-function stddev(arr, sample = true) {
+function stddev(arr, sample = false) {
   const v = variance(arr, sample);
   return Math.sqrt(v);

[Killed] BlockStatement
src/utils/statsUtils.js:45:41
   return Math.sqrt(v);
 }
 
-function pearsonCorrelation(xArr, yArr) {
-  const x = ensureNumericArray(xArr);
-  const y = ensureNumericArray(yArr);
-  const n = x.length;
-  if (n === 0 || y.length !== n) return NaN;
-  const meanX = mean(x), meanY = mean(y);
-  let num = 0, sx = 0, sy = 0;
-  for (let i = 0; i < n; i++) {
-    const dx = x[i] - meanX;
-    const dy = y[i] - meanY;
-    num += dx * dy;
-    sx += dx * dx;
-    sy += dy * dy;
-  }
-  const denom = Math.sqrt(sx * sy);
-  if (denom === 0) return NaN;
-  return num / denom;
-}
+function pearsonCorrelation(xArr, yArr) {}
 
 class RunningStats {
killedBy: statsUtils pearson correlation
statusReason: expected undefined to be a number

[Killed] EqualityOperator
src/utils/statsUtils.js:49:7
   const x = ensureNumericArray(xArr);
   const y = ensureNumericArray(yArr);
   const n = x.length;
-  if (n === 0 || y.length !== n) return NaN;
+  if (n !== 0 || y.length !== n) return NaN;
   const meanX = mean(x), meanY = mean(y);
   let num = 0, sx = 0, sy = 0;
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] ConditionalExpression
src/utils/statsUtils.js:49:7
   const x = ensureNumericArray(xArr);
   const y = ensureNumericArray(yArr);
   const n = x.length;
-  if (n === 0 || y.length !== n) return NaN;
+  if (true) return NaN;
   const meanX = mean(x), meanY = mean(y);
   let num = 0, sx = 0, sy = 0;
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] BlockStatement
src/utils/statsUtils.js:52:31
   if (n === 0 || y.length !== n) return NaN;
   const meanX = mean(x), meanY = mean(y);
   let num = 0, sx = 0, sy = 0;
-  for (let i = 0; i < n; i++) {
-    const dx = x[i] - meanX;
-    const dy = y[i] - meanY;
-    num += dx * dy;
-    sx += dx * dx;
-    sy += dy * dy;
-  }
+  for (let i = 0; i < n; i++) {}
   const denom = Math.sqrt(sx * sy);
   if (denom === 0) return NaN;
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] ConditionalExpression
src/utils/statsUtils.js:52:19
   if (n === 0 || y.length !== n) return NaN;
   const meanX = mean(x), meanY = mean(y);
   let num = 0, sx = 0, sy = 0;
-  for (let i = 0; i < n; i++) {
+  for (let i = 0; false; i++) {
     const dx = x[i] - meanX;
     const dy = y[i] - meanY;
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:53:16
   const meanX = mean(x), meanY = mean(y);
   let num = 0, sx = 0, sy = 0;
   for (let i = 0; i < n; i++) {
-    const dx = x[i] - meanX;
+    const dx = x[i] + meanX;
     const dy = y[i] - meanY;
     num += dx * dy;
killedBy: statsUtils pearson correlation
statusReason: expected 0.2182178902359924 to be close to 1 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:54:16
   let num = 0, sx = 0, sy = 0;
   for (let i = 0; i < n; i++) {
     const dx = x[i] - meanX;
-    const dy = y[i] - meanY;
+    const dy = y[i] + meanY;
     num += dx * dy;
     sx += dx * dx;
killedBy: statsUtils pearson correlation
statusReason: expected 0.2182178902359924 to be close to 1 +/- 1e-10

[Killed] AssignmentOperator
src/utils/statsUtils.js:55:5
   for (let i = 0; i < n; i++) {
     const dx = x[i] - meanX;
     const dy = y[i] - meanY;
-    num += dx * dy;
+    num -= dx * dy;
     sx += dx * dx;
     sy += dy * dy;
killedBy: statsUtils pearson correlation
statusReason: expected -1 to be close to 1 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:55:12
   for (let i = 0; i < n; i++) {
     const dx = x[i] - meanX;
     const dy = y[i] - meanY;
-    num += dx * dy;
+    num += dx / dy;
     sx += dx * dx;
     sy += dy * dy;
killedBy: statsUtils pearson correlation
statusReason: expected 0.2 to be close to 1 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:56:11
     const dx = x[i] - meanX;
     const dy = y[i] - meanY;
     num += dx * dy;
-    sx += dx * dx;
+    sx += dx / dx;
     sy += dy * dy;
   }
killedBy: statsUtils pearson correlation
statusReason: expected 1.118033988749895 to be close to 1 +/- 1e-10

[Killed] AssignmentOperator
src/utils/statsUtils.js:56:5
     const dx = x[i] - meanX;
     const dy = y[i] - meanY;
     num += dx * dy;
-    sx += dx * dx;
+    sx -= dx * dx;
     sy += dy * dy;
   }
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] AssignmentOperator
src/utils/statsUtils.js:57:5
     const dy = y[i] - meanY;
     num += dx * dy;
     sx += dx * dx;
-    sy += dy * dy;
+    sy -= dy * dy;
   }
   const denom = Math.sqrt(sx * sy);
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:57:11
     const dy = y[i] - meanY;
     num += dx * dy;
     sx += dx * dx;
-    sy += dy * dy;
+    sy += dy / dy;
   }
   const denom = Math.sqrt(sx * sy);
killedBy: statsUtils pearson correlation
statusReason: expected 2.23606797749979 to be close to 1 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:59:27
     sx += dx * dx;
     sy += dy * dy;
   }
-  const denom = Math.sqrt(sx * sy);
+  const denom = Math.sqrt(sx / sy);
   if (denom === 0) return NaN;
   return num / denom;
killedBy: statsUtils pearson correlation
statusReason: expected 20 to be close to 1 +/- 1e-10

[Killed] ConditionalExpression
src/utils/statsUtils.js:60:7
     sy += dy * dy;
   }
   const denom = Math.sqrt(sx * sy);
-  if (denom === 0) return NaN;
+  if (true) return NaN;
   return num / denom;
 }
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] EqualityOperator
src/utils/statsUtils.js:60:7
     sy += dy * dy;
   }
   const denom = Math.sqrt(sx * sy);
-  if (denom === 0) return NaN;
+  if (denom !== 0) return NaN;
   return num / denom;
 }
killedBy: statsUtils pearson correlation
statusReason: expected NaN to be close to 1 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:61:10
   }
   const denom = Math.sqrt(sx * sy);
   if (denom === 0) return NaN;
-  return num / denom;
+  return num * denom;
 }
 
killedBy: statsUtils pearson correlation
statusReason: expected 100 to be close to 1 +/- 1e-10

[Killed] BlockStatement
src/utils/statsUtils.js:65:17
 }
 
 class RunningStats {
-  constructor() { this.n = 0; this.mean = 0; this.M2 = 0; }
+  constructor() {}
   push(x) {
     const value = Number(x);
killedBy: statsUtils running stats
statusReason: expected NaN to equal 3

[Killed] BlockStatement
src/utils/statsUtils.js:66:11
 
 class RunningStats {
   constructor() { this.n = 0; this.mean = 0; this.M2 = 0; }
-  push(x) {
-    const value = Number(x);
-    if (!Number.isFinite(value)) throw new Error('non-numeric');
-    this.n += 1;
-    const delta = value - this.mean;
-    this.mean += delta / this.n;
-    const delta2 = value - this.mean;
-    this.M2 += delta * delta2;
-  }
+  push(x) {}
   variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
   stddev(sample = true) { return Math.sqrt(this.variance(sample)); }
killedBy: statsUtils running stats
statusReason: expected +0 to equal 3

[Killed] ConditionalExpression
src/utils/statsUtils.js:68:9
   constructor() { this.n = 0; this.mean = 0; this.M2 = 0; }
   push(x) {
     const value = Number(x);
-    if (!Number.isFinite(value)) throw new Error('non-numeric');
+    if (true) throw new Error('non-numeric');
     this.n += 1;
     const delta = value - this.mean;
killedBy: statsUtils running stats
statusReason: non-numeric

[Killed] BooleanLiteral
src/utils/statsUtils.js:68:9
   constructor() { this.n = 0; this.mean = 0; this.M2 = 0; }
   push(x) {
     const value = Number(x);
-    if (!Number.isFinite(value)) throw new Error('non-numeric');
+    if (Number.isFinite(value)) throw new Error('non-numeric');
     this.n += 1;
     const delta = value - this.mean;
killedBy: statsUtils running stats
statusReason: non-numeric

[Killed] AssignmentOperator
src/utils/statsUtils.js:69:5
   push(x) {
     const value = Number(x);
     if (!Number.isFinite(value)) throw new Error('non-numeric');
-    this.n += 1;
+    this.n -= 1;
     const delta = value - this.mean;
     this.mean += delta / this.n;
killedBy: statsUtils running stats
statusReason: expected -3 to equal 3

[Killed] ArithmeticOperator
src/utils/statsUtils.js:70:19
     const value = Number(x);
     if (!Number.isFinite(value)) throw new Error('non-numeric');
     this.n += 1;
-    const delta = value - this.mean;
+    const delta = value + this.mean;
     this.mean += delta / this.n;
     const delta2 = value - this.mean;
killedBy: statsUtils running stats
statusReason: expected 4.333333333333333 to be close to 2 +/- 1e-10

[Killed] AssignmentOperator
src/utils/statsUtils.js:71:5
     if (!Number.isFinite(value)) throw new Error('non-numeric');
     this.n += 1;
     const delta = value - this.mean;
-    this.mean += delta / this.n;
+    this.mean -= delta / this.n;
     const delta2 = value - this.mean;
     this.M2 += delta * delta2;
killedBy: statsUtils running stats
statusReason: expected -4.333333333333333 to be close to 2 +/- 1e-10

[Killed] ArithmeticOperator
src/utils/statsUtils.js:71:18
     if (!Number.isFinite(value)) throw new Error('non-numeric');
     this.n += 1;
     const delta = value - this.mean;
-    this.mean += delta / this.n;
+    this.mean += delta * this.n;
     const delta2 = value - this.mean;
     this.M2 += delta * delta2;
killedBy: statsUtils running stats
statusReason: expected 3 to be close to 2 +/- 1e-10

[Survived] ArithmeticOperator
src/utils/statsUtils.js:72:20
     this.n += 1;
     const delta = value - this.mean;
     this.mean += delta / this.n;
-    const delta2 = value - this.mean;
+    const delta2 = value + this.mean;
     this.M2 += delta * delta2;
   }

[Survived] ArithmeticOperator
src/utils/statsUtils.js:73:16
     const delta = value - this.mean;
     this.mean += delta / this.n;
     const delta2 = value - this.mean;
-    this.M2 += delta * delta2;
+    this.M2 += delta / delta2;
   }
   variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }

[Survived] AssignmentOperator
src/utils/statsUtils.js:73:5
     const delta = value - this.mean;
     this.mean += delta / this.n;
     const delta2 = value - this.mean;
-    this.M2 += delta * delta2;
+    this.M2 -= delta * delta2;
   }
   variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }

[NoCoverage] EqualityOperator
src/utils/statsUtils.js:75:33
     const delta2 = value - this.mean;
     this.M2 += delta * delta2;
   }
-  variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
+  variance(sample = true) { if (this.n <= 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
   stddev(sample = true) { return Math.sqrt(this.variance(sample)); }
   count() { return this.n; }

[NoCoverage] BlockStatement
src/utils/statsUtils.js:75:27
     const delta2 = value - this.mean;
     this.M2 += delta * delta2;
   }
-  variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
+  variance(sample = true) {}
   stddev(sample = true) { return Math.sqrt(this.variance(sample)); }
   count() { return this.n; }

[NoCoverage] BooleanLiteral
src/utils/statsUtils.js:76:19
     this.M2 += delta * delta2;
   }
   variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
-  stddev(sample = true) { return Math.sqrt(this.variance(sample)); }
+  stddev(sample = false) { return Math.sqrt(this.variance(sample)); }
   count() { return this.n; }
   getMean() { return this.mean; }

[NoCoverage] BlockStatement
src/utils/statsUtils.js:76:25
     this.M2 += delta * delta2;
   }
   variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
-  stddev(sample = true) { return Math.sqrt(this.variance(sample)); }
+  stddev(sample = true) {}
   count() { return this.n; }
   getMean() { return this.mean; }

[Killed] BlockStatement
src/utils/statsUtils.js:77:11
   }
   variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
   stddev(sample = true) { return Math.sqrt(this.variance(sample)); }
-  count() { return this.n; }
+  count() {}
   getMean() { return this.mean; }
 }
killedBy: statsUtils running stats
statusReason: expected undefined to equal 3

[Killed] BlockStatement
src/utils/statsUtils.js:78:13
   variance(sample = true) { if (this.n < 1) return NaN; return sample ? (this.M2 / (this.n - (this.n>1?1:0))) : (this.M2 / this.n); }
   stddev(sample = true) { return Math.sqrt(this.variance(sample)); }
   count() { return this.n; }
-  getMean() { return this.mean; }
+  getMean() {}
 }
 
killedBy: statsUtils running stats
statusReason: expected undefined to be a number

[Killed] ObjectLiteral
src/utils/statsUtils.js:81:18
   getMean() { return this.mean; }
 }
 
-module.exports = {
-  mean,
-  median,
-  variance,
-  stddev,
-  pearsonCorrelation,
-  RunningStats
-};
+module.exports = {};
 
killedBy: statsUtils mean & median
statusReason: s.mean is not a function
