[Killed] BlockStatement
src/calculator.js:7:13
 
 class Calculator {
   
-  add(a, b) {
-    if (a === null || b === null) return null;
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
-    return a + b;
-  }
+  add(a, b) {}
 
   subtract(a, b) {
killedBy: Calculator should add correctly
statusReason: expected undefined to equal 3

[Killed] EqualityOperator
src/calculator.js:8:9
 class Calculator {
   
   add(a, b) {
-    if (a === null || b === null) return null;
+    if (a !== null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     return a + b;
killedBy: Calculator should add correctly
statusReason: expected null to equal 3

[Killed] ConditionalExpression
src/calculator.js:8:9
 class Calculator {
   
   add(a, b) {
-    if (a === null || b === null) return null;
+    if (true) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     return a + b;
killedBy: Calculator should add correctly
statusReason: expected null to equal 3

[Killed] EqualityOperator
src/calculator.js:9:34
   
   add(a, b) {
     if (a === null || b === null) return null;
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
+    if (typeof a !== 'number' || typeof b === 'number') return null;
     return a + b;
   }
killedBy: Calculator should add correctly
statusReason: expected null to equal 3

[Killed] ConditionalExpression
src/calculator.js:9:9
   
   add(a, b) {
     if (a === null || b === null) return null;
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
+    if (true) return null;
     return a + b;
   }
killedBy: Calculator should add correctly
statusReason: expected null to equal 3

[Killed] ArithmeticOperator
src/calculator.js:10:12
   add(a, b) {
     if (a === null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
-    return a + b;
+    return a - b;
   }
 
killedBy: Calculator should add correctly
statusReason: expected -1 to equal 3

[Killed] BlockStatement
src/calculator.js:13:18
     return a + b;
   }
 
-  subtract(a, b) {
-    if (a === null || b === null) return null;
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
-    return a - b;
-  }
+  subtract(a, b) {}
 
   multiply(a, b) {
killedBy: Calculator should subtract correctly
statusReason: expected undefined to equal 2

[Killed] EqualityOperator
src/calculator.js:14:9
   }
 
   subtract(a, b) {
-    if (a === null || b === null) return null;
+    if (a !== null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     return a - b;
killedBy: Calculator should subtract correctly
statusReason: expected null to equal 2

[Killed] EqualityOperator
src/calculator.js:14:23
   }
 
   subtract(a, b) {
-    if (a === null || b === null) return null;
+    if (a === null || b !== null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     return a - b;
killedBy: Calculator should subtract correctly
statusReason: expected null to equal 2

[Killed] EqualityOperator
src/calculator.js:15:9
 
   subtract(a, b) {
     if (a === null || b === null) return null;
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
+    if (typeof a === 'number' || typeof b !== 'number') return null;
     return a - b;
   }
killedBy: Calculator should subtract correctly
statusReason: expected null to equal 2

[Killed] ArithmeticOperator
src/calculator.js:16:12
   subtract(a, b) {
     if (a === null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
-    return a - b;
+    return a + b;
   }
 
killedBy: Calculator should subtract correctly
statusReason: expected 8 to equal 2

[Killed] BlockStatement
src/calculator.js:19:18
     return a - b;
   }
 
-  multiply(a, b) {
-    if (a === null || b === null) return null;
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
-    return a * b;
-  }
+  multiply(a, b) {}
 
   divide(a, b) {
killedBy: Calculator should multiply correctly
statusReason: expected undefined to equal 12

[Killed] ConditionalExpression
src/calculator.js:20:9
   }
 
   multiply(a, b) {
-    if (a === null || b === null) return null;
+    if (true) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     return a * b;
killedBy: Calculator should multiply correctly
statusReason: expected null to equal 12

[Killed] EqualityOperator
src/calculator.js:20:9
   }
 
   multiply(a, b) {
-    if (a === null || b === null) return null;
+    if (a !== null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     return a * b;
killedBy: Calculator should multiply correctly
statusReason: expected null to equal 12

[Killed] ArithmeticOperator
src/calculator.js:22:12
   multiply(a, b) {
     if (a === null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
-    return a * b;
+    return a / b;
   }
 
killedBy: Calculator should multiply correctly
statusReason: expected 1.3333333333333333 to equal 12

[Killed] BlockStatement
src/calculator.js:25:16
     return a * b;
   }
 
-  divide(a, b) {
-    if (a === null || b === null) return null;
-    if (typeof a !== 'number' || typeof b !== 'number') return null;
-    if (b === 0) return null;
-    return a / b;
-  }
+  divide(a, b) {}
 }
 
killedBy: Calculator should divide correctly
statusReason: expected undefined to equal 4

[Killed] EqualityOperator
src/calculator.js:26:9
   }
 
   divide(a, b) {
-    if (a === null || b === null) return null;
+    if (a !== null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     if (b === 0) return null;
killedBy: Calculator should divide correctly
statusReason: expected null to equal 4

[Killed] ConditionalExpression
src/calculator.js:26:9
   }
 
   divide(a, b) {
-    if (a === null || b === null) return null;
+    if (true) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     if (b === 0) return null;
killedBy: Calculator should divide correctly
statusReason: expected null to equal 4

[Killed] ConditionalExpression
src/calculator.js:28:9
   divide(a, b) {
     if (a === null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
-    if (b === 0) return null;
+    if (false) return null;
     return a / b;
   }
killedBy: Calculator should return null on division by zero
statusReason: expected Infinity to equal null

[Killed] ConditionalExpression
src/calculator.js:28:9
   divide(a, b) {
     if (a === null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
-    if (b === 0) return null;
+    if (true) return null;
     return a / b;
   }
killedBy: Calculator should divide correctly
statusReason: expected null to equal 4

[Killed] ArithmeticOperator
src/calculator.js:29:12
     if (a === null || b === null) return null;
     if (typeof a !== 'number' || typeof b !== 'number') return null;
     if (b === 0) return null;
-    return a / b;
+    return a * b;
   }
 }
killedBy: Calculator should divide correctly
statusReason: expected 36 to equal 4
